GopalSaraf/Practicals/PSDL/include/proc/pic18f47q83.inc
// Register: C1TXREQ
#define C1TXREQ C1TXREQ
C1TXREQ                                  equ 0130h

// Register: C1TXREQL
#define C1TXREQL C1TXREQL
C1TXREQL                                 equ 0130h
// bitfield definitions
C1TXREQL_TXREQ_POSN                      equ 0000h
C1TXREQL_TXREQ_POSITION                  equ 0000h
C1TXREQL_TXREQ_SIZE                      equ 0008h
C1TXREQL_TXREQ_LENGTH                    equ 0008h
C1TXREQL_TXREQ_MASK                      equ 00FFh
C1TXREQL_TXREQ0_POSN                     equ 0000h
C1TXREQL_TXREQ0_POSITION                 equ 0000h
C1TXREQL_TXREQ0_SIZE                     equ 0001h
C1TXREQL_TXREQ0_LENGTH                   equ 0001h
C1TXREQL_TXREQ0_MASK                     equ 0001h
C1TXREQL_TXREQ1_POSN                     equ 0001h
C1TXREQL_TXREQ1_POSITION                 equ 0001h
C1TXREQL_TXREQ1_SIZE                     equ 0001h
C1TXREQL_TXREQ1_LENGTH                   equ 0001h
C1TXREQL_TXREQ1_MASK                     equ 0002h
C1TXREQL_TXREQ2_POSN                     equ 0002h
C1TXREQL_TXREQ2_POSITION                 equ 0002h
C1TXREQL_TXREQ2_SIZE                     equ 0001h
C1TXREQL_TXREQ2_LENGTH                   equ 0001h
C1TXREQL_TXREQ2_MASK                     equ 0004h
C1TXREQL_TXREQ3_POSN                     equ 0003h
C1TXREQL_TXREQ3_POSITION                 equ 0003h
C1TXREQL_TXREQ3_SIZE                     equ 0001h
C1TXREQL_TXREQ3_LENGTH                   equ 0001h
C1TXREQL_TXREQ3_MASK                     equ 0008h
C1TXREQL_TXREQ4_POSN                     equ 0004h
C1TXREQL_TXREQ4_POSITION                 equ 0004h
C1TXREQL_TXREQ4_SIZE                     equ 0001h
C1TXREQL_TXREQ4_LENGTH                   equ 0001h
C1TXREQL_TXREQ4_MASK                     equ 0010h
C1TXREQL_TXREQ5_POSN                     equ 0005h
C1TXREQL_TXREQ5_POSITION                 equ 0005h
C1TXREQL_TXREQ5_SIZE                     equ 0001h
C1TXREQL_TXREQ5_LENGTH                   equ 0001h
C1TXREQL_TXREQ5_MASK                     equ 0020h
C1TXREQL_TXREQ6_POSN                     equ 0006h
C1TXREQL_TXREQ6_POSITION                 equ 0006h
C1TXREQL_TXREQ6_SIZE                     equ 0001h
C1TXREQL_TXREQ6_LENGTH                   equ 0001h
C1TXREQL_TXREQ6_MASK                     equ 0040h
C1TXREQL_TXREQ7_POSN                     equ 0007h
C1TXREQL_TXREQ7_POSITION                 equ 0007h
C1TXREQL_TXREQ7_SIZE                     equ 0001h
C1TXREQL_TXREQ7_LENGTH                   equ 0001h
C1TXREQL_TXREQ7_MASK                     equ 0080h

// Register: C1TXREQH
#define C1TXREQH C1TXREQH
C1TXREQH                                 equ 0131h
// bitfield definitions
C1TXREQH_TXREQ_POSN                      equ 0000h
C1TXREQH_TXREQ_POSITION                  equ 0000h
C1TXREQH_TXREQ_SIZE                      equ 0008h
C1TXREQH_TXREQ_LENGTH                    equ 0008h
C1TXREQH_TXREQ_MASK                      equ 00FFh
C1TXREQH_TXREQ8_POSN                     equ 0000h
C1TXREQH_TXREQ8_POSITION                 equ 0000h
C1TXREQH_TXREQ8_SIZE                     equ 0001h
C1TXREQH_TXREQ8_LENGTH                   equ 0001h
C1TXREQH_TXREQ8_MASK                     equ 0001h
C1TXREQH_TXREQ9_POSN                     equ 0001h
C1TXREQH_TXREQ9_POSITION                 equ 0001h
C1TXREQH_TXREQ9_SIZE                     equ 0001h
C1TXREQH_TXREQ9_LENGTH                   equ 0001h
C1TXREQH_TXREQ9_MASK                     equ 0002h
C1TXREQH_TXREQ10_POSN                    equ 0002h
C1TXREQH_TXREQ10_POSITION                equ 0002h
C1TXREQH_TXREQ10_SIZE                    equ 0001h
C1TXREQH_TXREQ10_LENGTH                  equ 0001h
C1TXREQH_TXREQ10_MASK                    equ 0004h
C1TXREQH_TXREQ11_POSN                    equ 0003h
C1TXREQH_TXREQ11_POSITION                equ 0003h
C1TXREQH_TXREQ11_SIZE                    equ 0001h
C1TXREQH_TXREQ11_LENGTH                  equ 0001h
C1TXREQH_TXREQ11_MASK                    equ 0008h
C1TXREQH_TXREQ12_POSN                    equ 0004h
C1TXREQH_TXREQ12_POSITION                equ 0004h
C1TXREQH_TXREQ12_SIZE                    equ 0001h
C1TXREQH_TXREQ12_LENGTH                  equ 0001h
C1TXREQH_TXREQ12_MASK                    equ 0010h
C1TXREQH_TXREQ13_POSN                    equ 0005h
C1TXREQH_TXREQ13_POSITION                equ 0005h
C1TXREQH_TXREQ13_SIZE                    equ 0001h
C1TXREQH_TXREQ13_LENGTH                  equ 0001h
C1TXREQH_TXREQ13_MASK                    equ 0020h
C1TXREQH_TXREQ14_POSN                    equ 0006h
C1TXREQH_TXREQ14_POSITION                equ 0006h
C1TXREQH_TXREQ14_SIZE                    equ 0001h
C1TXREQH_TXREQ14_LENGTH                  equ 0001h
C1TXREQH_TXREQ14_MASK                    equ 0040h
C1TXREQH_TXREQ15_POSN                    equ 0007h
C1TXREQH_TXREQ15_POSITION                equ 0007h
C1TXREQH_TXREQ15_SIZE                    equ 0001h
C1TXREQH_TXREQ15_LENGTH                  equ 0001h
C1TXREQH_TXREQ15_MASK                    equ 0080h

// Register: C1TXREQU
#define C1TXREQU C1TXREQU
C1TXREQU                                 equ 0132h
// bitfield definitions
C1TXREQU_TXREQ_POSN                      equ 0000h
C1TXREQU_TXREQ_POSITION                  equ 0000h
C1TXREQU_TXREQ_SIZE                      equ 0008h
C1TXREQU_TXREQ_LENGTH                    equ 0008h
C1TXREQU_TXREQ_MASK                      equ 00FFh
C1TXREQU_TXREQ16_POSN                    equ 0000h
C1TXREQU_TXREQ16_POSITION                equ 0000h
C1TXREQU_TXREQ16_SIZE                    equ 0001h
C1TXREQU_TXREQ16_LENGTH                  equ 0001h
C1TXREQU_TXREQ16_MASK                    equ 0001h
C1TXREQU_TXREQ17_POSN                    equ 0001h
C1TXREQU_TXREQ17_POSITION                equ 0001h
C1TXREQU_TXREQ17_SIZE                    equ 0001h
C1TXREQU_TXREQ17_LENGTH                  equ 0001h
C1TXREQU_TXREQ17_MASK                    equ 0002h
C1TXREQU_TXREQ18_POSN                    equ 0002h
C1TXREQU_TXREQ18_POSITION                equ 0002h
C1TXREQU_TXREQ18_SIZE                    equ 0001h
C1TXREQU_TXREQ18_LENGTH                  equ 0001h
C1TXREQU_TXREQ18_MASK                    equ 0004h
C1TXREQU_TXREQ19_POSN                    equ 0003h
C1TXREQU_TXREQ19_POSITION                equ 0003h
C1TXREQU_TXREQ19_SIZE                    equ 0001h
C1TXREQU_TXREQ19_LENGTH                  equ 0001h
C1TXREQU_TXREQ19_MASK                    equ 0008h
C1TXREQU_TXREQ20_POSN                    equ 0004h
C1TXREQU_TXREQ20_POSITION                equ 0004h
C1TXREQU_TXREQ20_SIZE                    equ 0001h
C1TXREQU_TXREQ20_LENGTH                  equ 0001h
C1TXREQU_TXREQ20_MASK                    equ 0010h
C1TXREQU_TXREQ21_POSN                    equ 0005h
C1TXREQU_TXREQ21_POSITION                equ 0005h
C1TXREQU_TXREQ21_SIZE                    equ 0001h
C1TXREQU_TXREQ21_LENGTH                  equ 0001h
C1TXREQU_TXREQ21_MASK                    equ 0020h
C1TXREQU_TXREQ22_POSN                    equ 0006h
C1TXREQU_TXREQ22_POSITION                equ 0006h
C1TXREQU_TXREQ22_SIZE                    equ 0001h
C1TXREQU_TXREQ22_LENGTH                  equ 0001h
C1TXREQU_TXREQ22_MASK                    equ 0040h
C1TXREQU_TXREQ23_POSN                    equ 0007h
C1TXREQU_TXREQ23_POSITION                equ 0007h
C1TXREQU_TXREQ23_SIZE                    equ 0001h
C1TXREQU_TXREQ23_LENGTH                  equ 0001h
C1TXREQU_TXREQ23_MASK                    equ 0080h

// Register: C1TXREQT
#define C1TXREQT C1TXREQT
C1TXREQT                                 equ 0133h
// bitfield definitions
C1TXREQT_TXREQ_POSN                      equ 0000h
C1TXREQT_TXREQ_POSITION                  equ 0000h
C1TXREQT_TXREQ_SIZE                      equ 0008h
C1TXREQT_TXREQ_LENGTH                    equ 0008h
C1TXREQT_TXREQ_MASK                      equ 00FFh
C1TXREQT_TXREQ24_POSN                    equ 0000h
C1TXREQT_TXREQ24_POSITION                equ 0000h
C1TXREQT_TXREQ24_SIZE                    equ 0001h
C1TXREQT_TXREQ24_LENGTH                  equ 0001h
C1TXREQT_TXREQ24_MASK                    equ 0001h
C1TXREQT_TXREQ25_POSN                    equ 0001h
C1TXREQT_TXREQ25_POSITION                equ 0001h
C1TXREQT_TXREQ25_SIZE                    equ 0001h
C1TXREQT_TXREQ25_LENGTH                  equ 0001h
C1TXREQT_TXREQ25_MASK                    equ 0002h
C1TXREQT_TXREQ26_POSN                    equ 0002h
C1TXREQT_TXREQ26_POSITION                equ 0002h
C1TXREQT_TXREQ26_SIZE                    equ 0001h
C1TXREQT_TXREQ26_LENGTH                  equ 0001h
C1TXREQT_TXREQ26_MASK                    equ 0004h
C1TXREQT_TXREQ27_POSN                    equ 0003h
C1TXREQT_TXREQ27_POSITION                equ 0003h
C1TXREQT_TXREQ27_SIZE                    equ 0001h
C1TXREQT_TXREQ27_LENGTH                  equ 0001h
C1TXREQT_TXREQ27_MASK                    equ 0008h
C1TXREQT_TXREQ28_POSN                    equ 0004h
C1TXREQT_TXREQ28_POSITION                equ 0004h
C1TXREQT_TXREQ28_SIZE                    equ 0001h
C1TXREQT_TXREQ28_LENGTH                  equ 0001h
C1TXREQT_TXREQ28_MASK                    equ 0010h
C1TXREQT_TXREQ29_POSN                    equ 0005h
C1TXREQT_TXREQ29_POSITION                equ 0005h
C1TXREQT_TXREQ29_SIZE                    equ 0001h
C1TXREQT_TXREQ29_LENGTH                  equ 0001h
C1TXREQT_TXREQ29_MASK                    equ 0020h
C1TXREQT_TXREQ30_POSN                    equ 0006h
C1TXREQT_TXREQ30_POSITION                equ 0006h
C1TXREQT_TXREQ30_SIZE                    equ 0001h
C1TXREQT_TXREQ30_LENGTH                  equ 0001h
C1TXREQT_TXREQ30_MASK                    equ 0040h
C1TXREQT_TXREQ31_POSN                    equ 0007h
C1TXREQT_TXREQ31_POSITION                equ 0007h
C1TXREQT_TXREQ31_SIZE                    equ 0001h
C1TXREQT_TXREQ31_LENGTH                  equ 0001h
C1TXREQT_TXREQ31_MASK                    equ 0080h

// Register: C1TRECL
#define C1TRECL C1TRECL
C1TRECL                                  equ 0134h
// bitfield definitions
C1TRECL_RERRCNT_POSN                     equ 0000h
C1TRECL_RERRCNT_POSITION                 equ 0000h
C1TRECL_RERRCNT_SIZE                     equ 0008h
C1TRECL_RERRCNT_LENGTH                   equ 0008h
C1TRECL_RERRCNT_MASK                     equ 00FFh
C1TRECL_RERRCNT0_POSN                    equ 0000h
C1TRECL_RERRCNT0_POSITION                equ 0000h
C1TRECL_RERRCNT0_SIZE                    equ 0001h
C1TRECL_RERRCNT0_LENGTH                  equ 0001h
C1TRECL_RERRCNT0_MASK                    equ 0001h
C1TRECL_RERRCNT1_POSN                    equ 0001h
C1TRECL_RERRCNT1_POSITION                equ 0001h
C1TRECL_RERRCNT1_SIZE                    equ 0001h
C1TRECL_RERRCNT1_LENGTH                  equ 0001h
C1TRECL_RERRCNT1_MASK                    equ 0002h
C1TRECL_RERRCNT2_POSN                    equ 0002h
C1TRECL_RERRCNT2_POSITION                equ 0002h
C1TRECL_RERRCNT2_SIZE                    equ 0001h
C1TRECL_RERRCNT2_LENGTH                  equ 0001h
C1TRECL_RERRCNT2_MASK                    equ 0004h
C1TRECL_RERRCNT3_POSN                    equ 0003h
C1TRECL_RERRCNT3_POSITION                equ 0003h
C1TRECL_RERRCNT3_SIZE                    equ 0001h
C1TRECL_RERRCNT3_LENGTH                  equ 0001h
C1TRECL_RERRCNT3_MASK                    equ 0008h
C1TRECL_RERRCNT4_POSN                    equ 0004h
C1TRECL_RERRCNT4_POSITION                equ 0004h
C1TRECL_RERRCNT4_SIZE                    equ 0001h
C1TRECL_RERRCNT4_LENGTH                  equ 0001h
C1TRECL_RERRCNT4_MASK                    equ 0010h
C1TRECL_RERRCNT5_POSN                    equ 0005h
C1TRECL_RERRCNT5_POSITION                equ 0005h
C1TRECL_RERRCNT5_SIZE                    equ 0001h
C1TRECL_RERRCNT5_LENGTH                  equ 0001h
C1TRECL_RERRCNT5_MASK                    equ 0020h
C1TRECL_RERRCNT6_POSN                    equ 0006h
C1TRECL_RERRCNT6_POSITION                equ 0006h
C1TRECL_RERRCNT6_SIZE                    equ 0001h
C1TRECL_RERRCNT6_LENGTH                  equ 0001h
C1TRECL_RERRCNT6_MASK                    equ 0040h
C1TRECL_RERRCNT7_POSN                    equ 0007h
C1TRECL_RERRCNT7_POSITION                equ 0007h
C1TRECL_RERRCNT7_SIZE                    equ 0001h
C1TRECL_RERRCNT7_LENGTH                  equ 0001h
C1TRECL_RERRCNT7_MASK                    equ 0080h

// Register: C1TRECH
#define C1TRECH C1TRECH
C1TRECH                                  equ 0135h
// bitfield definitions
C1TRECH_TERRCNT_POSN                     equ 0000h
C1TRECH_TERRCNT_POSITION                 equ 0000h
C1TRECH_TERRCNT_SIZE                     equ 0008h
C1TRECH_TERRCNT_LENGTH                   equ 0008h
C1TRECH_TERRCNT_MASK                     equ 00FFh
C1TRECH_TERRCNT0_POSN                    equ 0000h
C1TRECH_TERRCNT0_POSITION                equ 0000h
C1TRECH_TERRCNT0_SIZE                    equ 0001h
C1TRECH_TERRCNT0_LENGTH                  equ 0001h
C1TRECH_TERRCNT0_MASK                    equ 0001h
C1TRECH_TERRCNT1_POSN                    equ 0001h
C1TRECH_TERRCNT1_POSITION                equ 0001h
C1TRECH_TERRCNT1_SIZE                    equ 0001h
C1TRECH_TERRCNT1_LENGTH                  equ 0001h
C1TRECH_TERRCNT1_MASK                    equ 0002h
C1TRECH_TERRCNT2_POSN                    equ 0002h
C1TRECH_TERRCNT2_POSITION                equ 0002h
C1TRECH_TERRCNT2_SIZE                    equ 0001h
C1TRECH_TERRCNT2_LENGTH                  equ 0001h
C1TRECH_TERRCNT2_MASK                    equ 0004h
C1TRECH_TERRCNT3_POSN                    equ 0003h
C1TRECH_TERRCNT3_POSITION                equ 0003h
C1TRECH_TERRCNT3_SIZE                    equ 0001h
C1TRECH_TERRCNT3_LENGTH                  equ 0001h
C1TRECH_TERRCNT3_MASK                    equ 0008h
C1TRECH_TERRCNT4_POSN                    equ 0004h
C1TRECH_TERRCNT4_POSITION                equ 0004h
C1TRECH_TERRCNT4_SIZE                    equ 0001h
C1TRECH_TERRCNT4_LENGTH                  equ 0001h
C1TRECH_TERRCNT4_MASK                    equ 0010h
C1TRECH_TERRCNT5_POSN                    equ 0005h
C1TRECH_TERRCNT5_POSITION                equ 0005h
C1TRECH_TERRCNT5_SIZE                    equ 0001h
C1TRECH_TERRCNT5_LENGTH                  equ 0001h
C1TRECH_TERRCNT5_MASK                    equ 0020h
C1TRECH_TERRCNT6_POSN                    equ 0006h
C1TRECH_TERRCNT6_POSITION                equ 0006h
C1TRECH_TERRCNT6_SIZE                    equ 0001h
C1TRECH_TERRCNT6_LENGTH                  equ 0001h
C1TRECH_TERRCNT6_MASK                    equ 0040h
C1TRECH_TERRCNT7_POSN                    equ 0007h
C1TRECH_TERRCNT7_POSITION                equ 0007h
C1TRECH_TERRCNT7_SIZE                    equ 0001h
C1TRECH_TERRCNT7_LENGTH                  equ 0001h
C1TRECH_TERRCNT7_MASK                    equ 0080h

// Register: C1TRECU
#define C1TRECU C1TRECU
C1TRECU                                  equ 0136h
// bitfield definitions
C1TRECU_EWARN_POSN                       equ 0000h
C1TRECU_EWARN_POSITION                   equ 0000h
C1TRECU_EWARN_SIZE                       equ 0001h
C1TRECU_EWARN_LENGTH                     equ 0001h
C1TRECU_EWARN_MASK                       equ 0001h
C1TRECU_RXWARN_POSN                      equ 0001h
C1TRECU_RXWARN_POSITION                  equ 0001h
C1TRECU_RXWARN_SIZE                      equ 0001h
C1TRECU_RXWARN_LENGTH                    equ 0001h
C1TRECU_RXWARN_MASK                      equ 0002h
C1TRECU_TXWARN_POSN                      equ 0002h
C1TRECU_TXWARN_POSITION                  equ 0002h
C1TRECU_TXWARN_SIZE                      equ 0001h
C1TRECU_TXWARN_LENGTH                    equ 0001h
C1TRECU_TXWARN_MASK                      equ 0004h
C1TRECU_RXBP_POSN                        equ 0003h
C1TRECU_RXBP_POSITION                    equ 0003h
C1TRECU_RXBP_SIZE                        equ 0001h
C1TRECU_RXBP_LENGTH                      equ 0001h
C1TRECU_RXBP_MASK                        equ 0008h
C1TRECU_TXBP_POSN                        equ 0004h
C1TRECU_TXBP_POSITION                    equ 0004h
C1TRECU_TXBP_SIZE                        equ 0001h
C1TRECU_TXBP_LENGTH                      equ 0001h
C1TRECU_TXBP_MASK                        equ 0010h
C1TRECU_TXBO_POSN                        equ 0005h
C1TRECU_TXBO_POSITION                    equ 0005h
C1TRECU_TXBO_SIZE                        equ 0001h
C1TRECU_TXBO_LENGTH                      equ 0001h
C1TRECU_TXBO_MASK                        equ 0020h

