GopalSaraf/Practicals/PSDL/include/proc/pic18f47q83.inc
// Register: C1FIFOCON1U
#define C1FIFOCON1U C1FIFOCON1U
C1FIFOCON1U                              equ 015Eh
// bitfield definitions
C1FIFOCON1U_TXPRI_POSN                   equ 0000h
C1FIFOCON1U_TXPRI_POSITION               equ 0000h
C1FIFOCON1U_TXPRI_SIZE                   equ 0005h
C1FIFOCON1U_TXPRI_LENGTH                 equ 0005h
C1FIFOCON1U_TXPRI_MASK                   equ 001Fh
C1FIFOCON1U_TXAT_POSN                    equ 0005h
C1FIFOCON1U_TXAT_POSITION                equ 0005h
C1FIFOCON1U_TXAT_SIZE                    equ 0002h
C1FIFOCON1U_TXAT_LENGTH                  equ 0002h
C1FIFOCON1U_TXAT_MASK                    equ 0060h
C1FIFOCON1U_TXPRI0_POSN                  equ 0000h
C1FIFOCON1U_TXPRI0_POSITION              equ 0000h
C1FIFOCON1U_TXPRI0_SIZE                  equ 0001h
C1FIFOCON1U_TXPRI0_LENGTH                equ 0001h
C1FIFOCON1U_TXPRI0_MASK                  equ 0001h
C1FIFOCON1U_TXPRI1_POSN                  equ 0001h
C1FIFOCON1U_TXPRI1_POSITION              equ 0001h
C1FIFOCON1U_TXPRI1_SIZE                  equ 0001h
C1FIFOCON1U_TXPRI1_LENGTH                equ 0001h
C1FIFOCON1U_TXPRI1_MASK                  equ 0002h
C1FIFOCON1U_TXPRI2_POSN                  equ 0002h
C1FIFOCON1U_TXPRI2_POSITION              equ 0002h
C1FIFOCON1U_TXPRI2_SIZE                  equ 0001h
C1FIFOCON1U_TXPRI2_LENGTH                equ 0001h
C1FIFOCON1U_TXPRI2_MASK                  equ 0004h
C1FIFOCON1U_TXPRI3_POSN                  equ 0003h
C1FIFOCON1U_TXPRI3_POSITION              equ 0003h
C1FIFOCON1U_TXPRI3_SIZE                  equ 0001h
C1FIFOCON1U_TXPRI3_LENGTH                equ 0001h
C1FIFOCON1U_TXPRI3_MASK                  equ 0008h
C1FIFOCON1U_TXPRI4_POSN                  equ 0004h
C1FIFOCON1U_TXPRI4_POSITION              equ 0004h
C1FIFOCON1U_TXPRI4_SIZE                  equ 0001h
C1FIFOCON1U_TXPRI4_LENGTH                equ 0001h
C1FIFOCON1U_TXPRI4_MASK                  equ 0010h
C1FIFOCON1U_TXAT0_POSN                   equ 0005h
C1FIFOCON1U_TXAT0_POSITION               equ 0005h
C1FIFOCON1U_TXAT0_SIZE                   equ 0001h
C1FIFOCON1U_TXAT0_LENGTH                 equ 0001h
C1FIFOCON1U_TXAT0_MASK                   equ 0020h
C1FIFOCON1U_TXAT1_POSN                   equ 0006h
C1FIFOCON1U_TXAT1_POSITION               equ 0006h
C1FIFOCON1U_TXAT1_SIZE                   equ 0001h
C1FIFOCON1U_TXAT1_LENGTH                 equ 0001h
C1FIFOCON1U_TXAT1_MASK                   equ 0040h

// Register: C1FIFOCON1T
#define C1FIFOCON1T C1FIFOCON1T
C1FIFOCON1T                              equ 015Fh
// bitfield definitions
C1FIFOCON1T_FSIZE_POSN                   equ 0000h
C1FIFOCON1T_FSIZE_POSITION               equ 0000h
C1FIFOCON1T_FSIZE_SIZE                   equ 0005h
C1FIFOCON1T_FSIZE_LENGTH                 equ 0005h
C1FIFOCON1T_FSIZE_MASK                   equ 001Fh
C1FIFOCON1T_FSIZE0_POSN                  equ 0000h
C1FIFOCON1T_FSIZE0_POSITION              equ 0000h
C1FIFOCON1T_FSIZE0_SIZE                  equ 0001h
C1FIFOCON1T_FSIZE0_LENGTH                equ 0001h
C1FIFOCON1T_FSIZE0_MASK                  equ 0001h
C1FIFOCON1T_FSIZE1_POSN                  equ 0001h
C1FIFOCON1T_FSIZE1_POSITION              equ 0001h
C1FIFOCON1T_FSIZE1_SIZE                  equ 0001h
C1FIFOCON1T_FSIZE1_LENGTH                equ 0001h
C1FIFOCON1T_FSIZE1_MASK                  equ 0002h
C1FIFOCON1T_FSIZE2_POSN                  equ 0002h
C1FIFOCON1T_FSIZE2_POSITION              equ 0002h
C1FIFOCON1T_FSIZE2_SIZE                  equ 0001h
C1FIFOCON1T_FSIZE2_LENGTH                equ 0001h
C1FIFOCON1T_FSIZE2_MASK                  equ 0004h
C1FIFOCON1T_FSIZE3_POSN                  equ 0003h
C1FIFOCON1T_FSIZE3_POSITION              equ 0003h
C1FIFOCON1T_FSIZE3_SIZE                  equ 0001h
C1FIFOCON1T_FSIZE3_LENGTH                equ 0001h
C1FIFOCON1T_FSIZE3_MASK                  equ 0008h
C1FIFOCON1T_FSIZE4_POSN                  equ 0004h
C1FIFOCON1T_FSIZE4_POSITION              equ 0004h
C1FIFOCON1T_FSIZE4_SIZE                  equ 0001h
C1FIFOCON1T_FSIZE4_LENGTH                equ 0001h
C1FIFOCON1T_FSIZE4_MASK                  equ 0010h

// Register: C1FIFOSTA1
#define C1FIFOSTA1 C1FIFOSTA1
C1FIFOSTA1                               equ 0160h

// Register: C1FIFOSTA1L
#define C1FIFOSTA1L C1FIFOSTA1L
C1FIFOSTA1L                              equ 0160h
// bitfield definitions
C1FIFOSTA1L_TFNRFNIF_POSN                equ 0000h
C1FIFOSTA1L_TFNRFNIF_POSITION            equ 0000h
C1FIFOSTA1L_TFNRFNIF_SIZE                equ 0001h
C1FIFOSTA1L_TFNRFNIF_LENGTH              equ 0001h
C1FIFOSTA1L_TFNRFNIF_MASK                equ 0001h
C1FIFOSTA1L_TFHRFHIF_POSN                equ 0001h
C1FIFOSTA1L_TFHRFHIF_POSITION            equ 0001h
C1FIFOSTA1L_TFHRFHIF_SIZE                equ 0001h
C1FIFOSTA1L_TFHRFHIF_LENGTH              equ 0001h
C1FIFOSTA1L_TFHRFHIF_MASK                equ 0002h
C1FIFOSTA1L_TFERFFIF_POSN                equ 0002h
C1FIFOSTA1L_TFERFFIF_POSITION            equ 0002h
C1FIFOSTA1L_TFERFFIF_SIZE                equ 0001h
C1FIFOSTA1L_TFERFFIF_LENGTH              equ 0001h
C1FIFOSTA1L_TFERFFIF_MASK                equ 0004h
C1FIFOSTA1L_RXOVIF_POSN                  equ 0003h
C1FIFOSTA1L_RXOVIF_POSITION              equ 0003h
C1FIFOSTA1L_RXOVIF_SIZE                  equ 0001h
C1FIFOSTA1L_RXOVIF_LENGTH                equ 0001h
C1FIFOSTA1L_RXOVIF_MASK                  equ 0008h
C1FIFOSTA1L_TXATIF_POSN                  equ 0004h
C1FIFOSTA1L_TXATIF_POSITION              equ 0004h
C1FIFOSTA1L_TXATIF_SIZE                  equ 0001h
C1FIFOSTA1L_TXATIF_LENGTH                equ 0001h
C1FIFOSTA1L_TXATIF_MASK                  equ 0010h
C1FIFOSTA1L_TXERR_POSN                   equ 0005h
C1FIFOSTA1L_TXERR_POSITION               equ 0005h
C1FIFOSTA1L_TXERR_SIZE                   equ 0001h
C1FIFOSTA1L_TXERR_LENGTH                 equ 0001h
C1FIFOSTA1L_TXERR_MASK                   equ 0020h
C1FIFOSTA1L_TXLARB_POSN                  equ 0006h
C1FIFOSTA1L_TXLARB_POSITION              equ 0006h
C1FIFOSTA1L_TXLARB_SIZE                  equ 0001h
C1FIFOSTA1L_TXLARB_LENGTH                equ 0001h
C1FIFOSTA1L_TXLARB_MASK                  equ 0040h
C1FIFOSTA1L_TXABT_POSN                   equ 0007h
C1FIFOSTA1L_TXABT_POSITION               equ 0007h
C1FIFOSTA1L_TXABT_SIZE                   equ 0001h
C1FIFOSTA1L_TXABT_LENGTH                 equ 0001h
C1FIFOSTA1L_TXABT_MASK                   equ 0080h

