GopalSaraf/Practicals/PSDL/include/proc/pic18f47q83.inc
// Register: C1FIFOCON3T
#define C1FIFOCON3T C1FIFOCON3T
C1FIFOCON3T                              equ 0177h
// bitfield definitions
C1FIFOCON3T_FSIZE_POSN                   equ 0000h
C1FIFOCON3T_FSIZE_POSITION               equ 0000h
C1FIFOCON3T_FSIZE_SIZE                   equ 0005h
C1FIFOCON3T_FSIZE_LENGTH                 equ 0005h
C1FIFOCON3T_FSIZE_MASK                   equ 001Fh
C1FIFOCON3T_FSIZE0_POSN                  equ 0000h
C1FIFOCON3T_FSIZE0_POSITION              equ 0000h
C1FIFOCON3T_FSIZE0_SIZE                  equ 0001h
C1FIFOCON3T_FSIZE0_LENGTH                equ 0001h
C1FIFOCON3T_FSIZE0_MASK                  equ 0001h
C1FIFOCON3T_FSIZE1_POSN                  equ 0001h
C1FIFOCON3T_FSIZE1_POSITION              equ 0001h
C1FIFOCON3T_FSIZE1_SIZE                  equ 0001h
C1FIFOCON3T_FSIZE1_LENGTH                equ 0001h
C1FIFOCON3T_FSIZE1_MASK                  equ 0002h
C1FIFOCON3T_FSIZE2_POSN                  equ 0002h
C1FIFOCON3T_FSIZE2_POSITION              equ 0002h
C1FIFOCON3T_FSIZE2_SIZE                  equ 0001h
C1FIFOCON3T_FSIZE2_LENGTH                equ 0001h
C1FIFOCON3T_FSIZE2_MASK                  equ 0004h
C1FIFOCON3T_FSIZE3_POSN                  equ 0003h
C1FIFOCON3T_FSIZE3_POSITION              equ 0003h
C1FIFOCON3T_FSIZE3_SIZE                  equ 0001h
C1FIFOCON3T_FSIZE3_LENGTH                equ 0001h
C1FIFOCON3T_FSIZE3_MASK                  equ 0008h
C1FIFOCON3T_FSIZE4_POSN                  equ 0004h
C1FIFOCON3T_FSIZE4_POSITION              equ 0004h
C1FIFOCON3T_FSIZE4_SIZE                  equ 0001h
C1FIFOCON3T_FSIZE4_LENGTH                equ 0001h
C1FIFOCON3T_FSIZE4_MASK                  equ 0010h

// Register: C1FIFOSTA3
#define C1FIFOSTA3 C1FIFOSTA3
C1FIFOSTA3                               equ 0178h

// Register: C1FIFOSTA3L
#define C1FIFOSTA3L C1FIFOSTA3L
C1FIFOSTA3L                              equ 0178h
// bitfield definitions
C1FIFOSTA3L_TFNRFNIF_POSN                equ 0000h
C1FIFOSTA3L_TFNRFNIF_POSITION            equ 0000h
C1FIFOSTA3L_TFNRFNIF_SIZE                equ 0001h
C1FIFOSTA3L_TFNRFNIF_LENGTH              equ 0001h
C1FIFOSTA3L_TFNRFNIF_MASK                equ 0001h
C1FIFOSTA3L_TFHRFHIF_POSN                equ 0001h
C1FIFOSTA3L_TFHRFHIF_POSITION            equ 0001h
C1FIFOSTA3L_TFHRFHIF_SIZE                equ 0001h
C1FIFOSTA3L_TFHRFHIF_LENGTH              equ 0001h
C1FIFOSTA3L_TFHRFHIF_MASK                equ 0002h
C1FIFOSTA3L_TFERFFIF_POSN                equ 0002h
C1FIFOSTA3L_TFERFFIF_POSITION            equ 0002h
C1FIFOSTA3L_TFERFFIF_SIZE                equ 0001h
C1FIFOSTA3L_TFERFFIF_LENGTH              equ 0001h
C1FIFOSTA3L_TFERFFIF_MASK                equ 0004h
C1FIFOSTA3L_RXOVIF_POSN                  equ 0003h
C1FIFOSTA3L_RXOVIF_POSITION              equ 0003h
C1FIFOSTA3L_RXOVIF_SIZE                  equ 0001h
C1FIFOSTA3L_RXOVIF_LENGTH                equ 0001h
C1FIFOSTA3L_RXOVIF_MASK                  equ 0008h
C1FIFOSTA3L_TXATIF_POSN                  equ 0004h
C1FIFOSTA3L_TXATIF_POSITION              equ 0004h
C1FIFOSTA3L_TXATIF_SIZE                  equ 0001h
C1FIFOSTA3L_TXATIF_LENGTH                equ 0001h
C1FIFOSTA3L_TXATIF_MASK                  equ 0010h
C1FIFOSTA3L_TXERR_POSN                   equ 0005h
C1FIFOSTA3L_TXERR_POSITION               equ 0005h
C1FIFOSTA3L_TXERR_SIZE                   equ 0001h
C1FIFOSTA3L_TXERR_LENGTH                 equ 0001h
C1FIFOSTA3L_TXERR_MASK                   equ 0020h
C1FIFOSTA3L_TXLARB_POSN                  equ 0006h
C1FIFOSTA3L_TXLARB_POSITION              equ 0006h
C1FIFOSTA3L_TXLARB_SIZE                  equ 0001h
C1FIFOSTA3L_TXLARB_LENGTH                equ 0001h
C1FIFOSTA3L_TXLARB_MASK                  equ 0040h
C1FIFOSTA3L_TXABT_POSN                   equ 0007h
C1FIFOSTA3L_TXABT_POSITION               equ 0007h
C1FIFOSTA3L_TXABT_SIZE                   equ 0001h
C1FIFOSTA3L_TXABT_LENGTH                 equ 0001h
C1FIFOSTA3L_TXABT_MASK                   equ 0080h

// Register: C1FIFOSTA3H
#define C1FIFOSTA3H C1FIFOSTA3H
C1FIFOSTA3H                              equ 0179h
// bitfield definitions
C1FIFOSTA3H_FIFOCI_POSN                  equ 0000h
C1FIFOSTA3H_FIFOCI_POSITION              equ 0000h
C1FIFOSTA3H_FIFOCI_SIZE                  equ 0005h
C1FIFOSTA3H_FIFOCI_LENGTH                equ 0005h
C1FIFOSTA3H_FIFOCI_MASK                  equ 001Fh
C1FIFOSTA3H_FIFOCI0_POSN                 equ 0000h
C1FIFOSTA3H_FIFOCI0_POSITION             equ 0000h
C1FIFOSTA3H_FIFOCI0_SIZE                 equ 0001h
C1FIFOSTA3H_FIFOCI0_LENGTH               equ 0001h
C1FIFOSTA3H_FIFOCI0_MASK                 equ 0001h
C1FIFOSTA3H_FIFOCI1_POSN                 equ 0001h
C1FIFOSTA3H_FIFOCI1_POSITION             equ 0001h
C1FIFOSTA3H_FIFOCI1_SIZE                 equ 0001h
C1FIFOSTA3H_FIFOCI1_LENGTH               equ 0001h
C1FIFOSTA3H_FIFOCI1_MASK                 equ 0002h
C1FIFOSTA3H_FIFOCI2_POSN                 equ 0002h
C1FIFOSTA3H_FIFOCI2_POSITION             equ 0002h
C1FIFOSTA3H_FIFOCI2_SIZE                 equ 0001h
C1FIFOSTA3H_FIFOCI2_LENGTH               equ 0001h
C1FIFOSTA3H_FIFOCI2_MASK                 equ 0004h
C1FIFOSTA3H_FIFOCI3_POSN                 equ 0003h
C1FIFOSTA3H_FIFOCI3_POSITION             equ 0003h
C1FIFOSTA3H_FIFOCI3_SIZE                 equ 0001h
C1FIFOSTA3H_FIFOCI3_LENGTH               equ 0001h
C1FIFOSTA3H_FIFOCI3_MASK                 equ 0008h
C1FIFOSTA3H_FIFOCI4_POSN                 equ 0004h
C1FIFOSTA3H_FIFOCI4_POSITION             equ 0004h
C1FIFOSTA3H_FIFOCI4_SIZE                 equ 0001h
C1FIFOSTA3H_FIFOCI4_LENGTH               equ 0001h
C1FIFOSTA3H_FIFOCI4_MASK                 equ 0010h

// Register: C1FIFOSTA3U
#define C1FIFOSTA3U C1FIFOSTA3U
C1FIFOSTA3U                              equ 017Ah

// Register: C1FIFOSTA3T
#define C1FIFOSTA3T C1FIFOSTA3T
C1FIFOSTA3T                              equ 017Bh

// Register: C1FIFOUA3
#define C1FIFOUA3 C1FIFOUA3
C1FIFOUA3                                equ 017Ch

// Register: C1FIFOUA3L
#define C1FIFOUA3L C1FIFOUA3L
C1FIFOUA3L                               equ 017Ch
// bitfield definitions
C1FIFOUA3L_FIFOUA_POSN                   equ 0000h
C1FIFOUA3L_FIFOUA_POSITION               equ 0000h
C1FIFOUA3L_FIFOUA_SIZE                   equ 0008h
C1FIFOUA3L_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA3L_FIFOUA_MASK                   equ 00FFh
C1FIFOUA3L_FIFOUA0_POSN                  equ 0000h
C1FIFOUA3L_FIFOUA0_POSITION              equ 0000h
C1FIFOUA3L_FIFOUA0_SIZE                  equ 0001h
C1FIFOUA3L_FIFOUA0_LENGTH                equ 0001h
C1FIFOUA3L_FIFOUA0_MASK                  equ 0001h
C1FIFOUA3L_FIFOUA1_POSN                  equ 0001h
C1FIFOUA3L_FIFOUA1_POSITION              equ 0001h
C1FIFOUA3L_FIFOUA1_SIZE                  equ 0001h
C1FIFOUA3L_FIFOUA1_LENGTH                equ 0001h
C1FIFOUA3L_FIFOUA1_MASK                  equ 0002h
C1FIFOUA3L_FIFOUA2_POSN                  equ 0002h
C1FIFOUA3L_FIFOUA2_POSITION              equ 0002h
C1FIFOUA3L_FIFOUA2_SIZE                  equ 0001h
C1FIFOUA3L_FIFOUA2_LENGTH                equ 0001h
C1FIFOUA3L_FIFOUA2_MASK                  equ 0004h
C1FIFOUA3L_FIFOUA3_POSN                  equ 0003h
C1FIFOUA3L_FIFOUA3_POSITION              equ 0003h
C1FIFOUA3L_FIFOUA3_SIZE                  equ 0001h
C1FIFOUA3L_FIFOUA3_LENGTH                equ 0001h
C1FIFOUA3L_FIFOUA3_MASK                  equ 0008h
C1FIFOUA3L_FIFOUA4_POSN                  equ 0004h
C1FIFOUA3L_FIFOUA4_POSITION              equ 0004h
C1FIFOUA3L_FIFOUA4_SIZE                  equ 0001h
C1FIFOUA3L_FIFOUA4_LENGTH                equ 0001h
C1FIFOUA3L_FIFOUA4_MASK                  equ 0010h
C1FIFOUA3L_FIFOUA5_POSN                  equ 0005h
C1FIFOUA3L_FIFOUA5_POSITION              equ 0005h
C1FIFOUA3L_FIFOUA5_SIZE                  equ 0001h
C1FIFOUA3L_FIFOUA5_LENGTH                equ 0001h
C1FIFOUA3L_FIFOUA5_MASK                  equ 0020h
C1FIFOUA3L_FIFOUA6_POSN                  equ 0006h
C1FIFOUA3L_FIFOUA6_POSITION              equ 0006h
C1FIFOUA3L_FIFOUA6_SIZE                  equ 0001h
C1FIFOUA3L_FIFOUA6_LENGTH                equ 0001h
C1FIFOUA3L_FIFOUA6_MASK                  equ 0040h
C1FIFOUA3L_FIFOUA7_POSN                  equ 0007h
C1FIFOUA3L_FIFOUA7_POSITION              equ 0007h
C1FIFOUA3L_FIFOUA7_SIZE                  equ 0001h
C1FIFOUA3L_FIFOUA7_LENGTH                equ 0001h
C1FIFOUA3L_FIFOUA7_MASK                  equ 0080h

// Register: C1FIFOUA3H
#define C1FIFOUA3H C1FIFOUA3H
C1FIFOUA3H                               equ 017Dh
// bitfield definitions
C1FIFOUA3H_FIFOUA_POSN                   equ 0000h
C1FIFOUA3H_FIFOUA_POSITION               equ 0000h
C1FIFOUA3H_FIFOUA_SIZE                   equ 0008h
C1FIFOUA3H_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA3H_FIFOUA_MASK                   equ 00FFh
C1FIFOUA3H_FIFOUA8_POSN                  equ 0000h
C1FIFOUA3H_FIFOUA8_POSITION              equ 0000h
C1FIFOUA3H_FIFOUA8_SIZE                  equ 0001h
C1FIFOUA3H_FIFOUA8_LENGTH                equ 0001h
C1FIFOUA3H_FIFOUA8_MASK                  equ 0001h
C1FIFOUA3H_FIFOUA9_POSN                  equ 0001h
C1FIFOUA3H_FIFOUA9_POSITION              equ 0001h
C1FIFOUA3H_FIFOUA9_SIZE                  equ 0001h
C1FIFOUA3H_FIFOUA9_LENGTH                equ 0001h
C1FIFOUA3H_FIFOUA9_MASK                  equ 0002h
C1FIFOUA3H_FIFOUA10_POSN                 equ 0002h
C1FIFOUA3H_FIFOUA10_POSITION             equ 0002h
C1FIFOUA3H_FIFOUA10_SIZE                 equ 0001h
C1FIFOUA3H_FIFOUA10_LENGTH               equ 0001h
C1FIFOUA3H_FIFOUA10_MASK                 equ 0004h
C1FIFOUA3H_FIFOUA11_POSN                 equ 0003h
C1FIFOUA3H_FIFOUA11_POSITION             equ 0003h
C1FIFOUA3H_FIFOUA11_SIZE                 equ 0001h
C1FIFOUA3H_FIFOUA11_LENGTH               equ 0001h
C1FIFOUA3H_FIFOUA11_MASK                 equ 0008h
C1FIFOUA3H_FIFOUA12_POSN                 equ 0004h
C1FIFOUA3H_FIFOUA12_POSITION             equ 0004h
C1FIFOUA3H_FIFOUA12_SIZE                 equ 0001h
C1FIFOUA3H_FIFOUA12_LENGTH               equ 0001h
C1FIFOUA3H_FIFOUA12_MASK                 equ 0010h
C1FIFOUA3H_FIFOUA13_POSN                 equ 0005h
C1FIFOUA3H_FIFOUA13_POSITION             equ 0005h
C1FIFOUA3H_FIFOUA13_SIZE                 equ 0001h
C1FIFOUA3H_FIFOUA13_LENGTH               equ 0001h
C1FIFOUA3H_FIFOUA13_MASK                 equ 0020h
C1FIFOUA3H_FIFOUA14_POSN                 equ 0006h
C1FIFOUA3H_FIFOUA14_POSITION             equ 0006h
C1FIFOUA3H_FIFOUA14_SIZE                 equ 0001h
C1FIFOUA3H_FIFOUA14_LENGTH               equ 0001h
C1FIFOUA3H_FIFOUA14_MASK                 equ 0040h
C1FIFOUA3H_FIFOUA15_POSN                 equ 0007h
C1FIFOUA3H_FIFOUA15_POSITION             equ 0007h
C1FIFOUA3H_FIFOUA15_SIZE                 equ 0001h
C1FIFOUA3H_FIFOUA15_LENGTH               equ 0001h
C1FIFOUA3H_FIFOUA15_MASK                 equ 0080h

// Register: C1FIFOUA3U
#define C1FIFOUA3U C1FIFOUA3U
C1FIFOUA3U                               equ 017Eh
// bitfield definitions
C1FIFOUA3U_FIFOUA_POSN                   equ 0000h
C1FIFOUA3U_FIFOUA_POSITION               equ 0000h
C1FIFOUA3U_FIFOUA_SIZE                   equ 0008h
C1FIFOUA3U_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA3U_FIFOUA_MASK                   equ 00FFh
C1FIFOUA3U_FIFOUA16_POSN                 equ 0000h
C1FIFOUA3U_FIFOUA16_POSITION             equ 0000h
C1FIFOUA3U_FIFOUA16_SIZE                 equ 0001h
C1FIFOUA3U_FIFOUA16_LENGTH               equ 0001h
C1FIFOUA3U_FIFOUA16_MASK                 equ 0001h
C1FIFOUA3U_FIFOUA17_POSN                 equ 0001h
C1FIFOUA3U_FIFOUA17_POSITION             equ 0001h
C1FIFOUA3U_FIFOUA17_SIZE                 equ 0001h
C1FIFOUA3U_FIFOUA17_LENGTH               equ 0001h
C1FIFOUA3U_FIFOUA17_MASK                 equ 0002h
C1FIFOUA3U_FIFOUA18_POSN                 equ 0002h
C1FIFOUA3U_FIFOUA18_POSITION             equ 0002h
C1FIFOUA3U_FIFOUA18_SIZE                 equ 0001h
C1FIFOUA3U_FIFOUA18_LENGTH               equ 0001h
C1FIFOUA3U_FIFOUA18_MASK                 equ 0004h
C1FIFOUA3U_FIFOUA19_POSN                 equ 0003h
C1FIFOUA3U_FIFOUA19_POSITION             equ 0003h
C1FIFOUA3U_FIFOUA19_SIZE                 equ 0001h
C1FIFOUA3U_FIFOUA19_LENGTH               equ 0001h
C1FIFOUA3U_FIFOUA19_MASK                 equ 0008h
C1FIFOUA3U_FIFOUA20_POSN                 equ 0004h
C1FIFOUA3U_FIFOUA20_POSITION             equ 0004h
C1FIFOUA3U_FIFOUA20_SIZE                 equ 0001h
C1FIFOUA3U_FIFOUA20_LENGTH               equ 0001h
C1FIFOUA3U_FIFOUA20_MASK                 equ 0010h
C1FIFOUA3U_FIFOUA21_POSN                 equ 0005h
C1FIFOUA3U_FIFOUA21_POSITION             equ 0005h
C1FIFOUA3U_FIFOUA21_SIZE                 equ 0001h
C1FIFOUA3U_FIFOUA21_LENGTH               equ 0001h
C1FIFOUA3U_FIFOUA21_MASK                 equ 0020h
C1FIFOUA3U_FIFOUA22_POSN                 equ 0006h
C1FIFOUA3U_FIFOUA22_POSITION             equ 0006h
C1FIFOUA3U_FIFOUA22_SIZE                 equ 0001h
C1FIFOUA3U_FIFOUA22_LENGTH               equ 0001h
C1FIFOUA3U_FIFOUA22_MASK                 equ 0040h
C1FIFOUA3U_FIFOUA23_POSN                 equ 0007h
C1FIFOUA3U_FIFOUA23_POSITION             equ 0007h
C1FIFOUA3U_FIFOUA23_SIZE                 equ 0001h
C1FIFOUA3U_FIFOUA23_LENGTH               equ 0001h
C1FIFOUA3U_FIFOUA23_MASK                 equ 0080h

// Register: C1FIFOUA3T
#define C1FIFOUA3T C1FIFOUA3T
C1FIFOUA3T                               equ 017Fh
// bitfield definitions
C1FIFOUA3T_FIFOUA_POSN                   equ 0000h
C1FIFOUA3T_FIFOUA_POSITION               equ 0000h
C1FIFOUA3T_FIFOUA_SIZE                   equ 0008h
C1FIFOUA3T_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA3T_FIFOUA_MASK                   equ 00FFh
C1FIFOUA3T_FIFOUA24_POSN                 equ 0000h
C1FIFOUA3T_FIFOUA24_POSITION             equ 0000h
C1FIFOUA3T_FIFOUA24_SIZE                 equ 0001h
C1FIFOUA3T_FIFOUA24_LENGTH               equ 0001h
C1FIFOUA3T_FIFOUA24_MASK                 equ 0001h
C1FIFOUA3T_FIFOUA25_POSN                 equ 0001h
C1FIFOUA3T_FIFOUA25_POSITION             equ 0001h
C1FIFOUA3T_FIFOUA25_SIZE                 equ 0001h
C1FIFOUA3T_FIFOUA25_LENGTH               equ 0001h
C1FIFOUA3T_FIFOUA25_MASK                 equ 0002h
C1FIFOUA3T_FIFOUA26_POSN                 equ 0002h
C1FIFOUA3T_FIFOUA26_POSITION             equ 0002h
C1FIFOUA3T_FIFOUA26_SIZE                 equ 0001h
C1FIFOUA3T_FIFOUA26_LENGTH               equ 0001h
C1FIFOUA3T_FIFOUA26_MASK                 equ 0004h
C1FIFOUA3T_FIFOUA27_POSN                 equ 0003h
C1FIFOUA3T_FIFOUA27_POSITION             equ 0003h
C1FIFOUA3T_FIFOUA27_SIZE                 equ 0001h
C1FIFOUA3T_FIFOUA27_LENGTH               equ 0001h
C1FIFOUA3T_FIFOUA27_MASK                 equ 0008h
C1FIFOUA3T_FIFOUA28_POSN                 equ 0004h
C1FIFOUA3T_FIFOUA28_POSITION             equ 0004h
C1FIFOUA3T_FIFOUA28_SIZE                 equ 0001h
C1FIFOUA3T_FIFOUA28_LENGTH               equ 0001h
C1FIFOUA3T_FIFOUA28_MASK                 equ 0010h
C1FIFOUA3T_FIFOUA29_POSN                 equ 0005h
C1FIFOUA3T_FIFOUA29_POSITION             equ 0005h
C1FIFOUA3T_FIFOUA29_SIZE                 equ 0001h
C1FIFOUA3T_FIFOUA29_LENGTH               equ 0001h
C1FIFOUA3T_FIFOUA29_MASK                 equ 0020h
C1FIFOUA3T_FIFOUA30_POSN                 equ 0006h
C1FIFOUA3T_FIFOUA30_POSITION             equ 0006h
C1FIFOUA3T_FIFOUA30_SIZE                 equ 0001h
C1FIFOUA3T_FIFOUA30_LENGTH               equ 0001h
C1FIFOUA3T_FIFOUA30_MASK                 equ 0040h
C1FIFOUA3T_FIFOUA31_POSN                 equ 0007h
C1FIFOUA3T_FIFOUA31_POSITION             equ 0007h
C1FIFOUA3T_FIFOUA31_SIZE                 equ 0001h
C1FIFOUA3T_FIFOUA31_LENGTH               equ 0001h
C1FIFOUA3T_FIFOUA31_MASK                 equ 0080h

