GopalSaraf/Practicals/PSDL/include/proc/pic18f47q83.inc
// Register: C1FLTCON0L
#define C1FLTCON0L C1FLTCON0L
C1FLTCON0L                               equ 0180h
// bitfield definitions
C1FLTCON0L_F0BP_POSN                     equ 0000h
C1FLTCON0L_F0BP_POSITION                 equ 0000h
C1FLTCON0L_F0BP_SIZE                     equ 0005h
C1FLTCON0L_F0BP_LENGTH                   equ 0005h
C1FLTCON0L_F0BP_MASK                     equ 001Fh
C1FLTCON0L_FLTEN0_POSN                   equ 0007h
C1FLTCON0L_FLTEN0_POSITION               equ 0007h
C1FLTCON0L_FLTEN0_SIZE                   equ 0001h
C1FLTCON0L_FLTEN0_LENGTH                 equ 0001h
C1FLTCON0L_FLTEN0_MASK                   equ 0080h
C1FLTCON0L_F0BP0_POSN                    equ 0000h
C1FLTCON0L_F0BP0_POSITION                equ 0000h
C1FLTCON0L_F0BP0_SIZE                    equ 0001h
C1FLTCON0L_F0BP0_LENGTH                  equ 0001h
C1FLTCON0L_F0BP0_MASK                    equ 0001h
C1FLTCON0L_F0BP1_POSN                    equ 0001h
C1FLTCON0L_F0BP1_POSITION                equ 0001h
C1FLTCON0L_F0BP1_SIZE                    equ 0001h
C1FLTCON0L_F0BP1_LENGTH                  equ 0001h
C1FLTCON0L_F0BP1_MASK                    equ 0002h
C1FLTCON0L_F0BP2_POSN                    equ 0002h
C1FLTCON0L_F0BP2_POSITION                equ 0002h
C1FLTCON0L_F0BP2_SIZE                    equ 0001h
C1FLTCON0L_F0BP2_LENGTH                  equ 0001h
C1FLTCON0L_F0BP2_MASK                    equ 0004h
C1FLTCON0L_F0BP3_POSN                    equ 0003h
C1FLTCON0L_F0BP3_POSITION                equ 0003h
C1FLTCON0L_F0BP3_SIZE                    equ 0001h
C1FLTCON0L_F0BP3_LENGTH                  equ 0001h
C1FLTCON0L_F0BP3_MASK                    equ 0008h
C1FLTCON0L_F0BP4_POSN                    equ 0004h
C1FLTCON0L_F0BP4_POSITION                equ 0004h
C1FLTCON0L_F0BP4_SIZE                    equ 0001h
C1FLTCON0L_F0BP4_LENGTH                  equ 0001h
C1FLTCON0L_F0BP4_MASK                    equ 0010h

// Register: C1FLTCON0H
#define C1FLTCON0H C1FLTCON0H
C1FLTCON0H                               equ 0181h
// bitfield definitions
C1FLTCON0H_F1BP_POSN                     equ 0000h
C1FLTCON0H_F1BP_POSITION                 equ 0000h
C1FLTCON0H_F1BP_SIZE                     equ 0005h
C1FLTCON0H_F1BP_LENGTH                   equ 0005h
C1FLTCON0H_F1BP_MASK                     equ 001Fh
C1FLTCON0H_FLTEN1_POSN                   equ 0007h
C1FLTCON0H_FLTEN1_POSITION               equ 0007h
C1FLTCON0H_FLTEN1_SIZE                   equ 0001h
C1FLTCON0H_FLTEN1_LENGTH                 equ 0001h
C1FLTCON0H_FLTEN1_MASK                   equ 0080h
C1FLTCON0H_F1BP0_POSN                    equ 0000h
C1FLTCON0H_F1BP0_POSITION                equ 0000h
C1FLTCON0H_F1BP0_SIZE                    equ 0001h
C1FLTCON0H_F1BP0_LENGTH                  equ 0001h
C1FLTCON0H_F1BP0_MASK                    equ 0001h
C1FLTCON0H_F1BP1_POSN                    equ 0001h
C1FLTCON0H_F1BP1_POSITION                equ 0001h
C1FLTCON0H_F1BP1_SIZE                    equ 0001h
C1FLTCON0H_F1BP1_LENGTH                  equ 0001h
C1FLTCON0H_F1BP1_MASK                    equ 0002h
C1FLTCON0H_F1BP2_POSN                    equ 0002h
C1FLTCON0H_F1BP2_POSITION                equ 0002h
C1FLTCON0H_F1BP2_SIZE                    equ 0001h
C1FLTCON0H_F1BP2_LENGTH                  equ 0001h
C1FLTCON0H_F1BP2_MASK                    equ 0004h
C1FLTCON0H_F1BP3_POSN                    equ 0003h
C1FLTCON0H_F1BP3_POSITION                equ 0003h
C1FLTCON0H_F1BP3_SIZE                    equ 0001h
C1FLTCON0H_F1BP3_LENGTH                  equ 0001h
C1FLTCON0H_F1BP3_MASK                    equ 0008h
C1FLTCON0H_F1BP4_POSN                    equ 0004h
C1FLTCON0H_F1BP4_POSITION                equ 0004h
C1FLTCON0H_F1BP4_SIZE                    equ 0001h
C1FLTCON0H_F1BP4_LENGTH                  equ 0001h
C1FLTCON0H_F1BP4_MASK                    equ 0010h

// Register: C1FLTCON0U
#define C1FLTCON0U C1FLTCON0U
C1FLTCON0U                               equ 0182h
// bitfield definitions
C1FLTCON0U_F2BP_POSN                     equ 0000h
C1FLTCON0U_F2BP_POSITION                 equ 0000h
C1FLTCON0U_F2BP_SIZE                     equ 0005h
C1FLTCON0U_F2BP_LENGTH                   equ 0005h
C1FLTCON0U_F2BP_MASK                     equ 001Fh
C1FLTCON0U_FLTEN2_POSN                   equ 0007h
C1FLTCON0U_FLTEN2_POSITION               equ 0007h
C1FLTCON0U_FLTEN2_SIZE                   equ 0001h
C1FLTCON0U_FLTEN2_LENGTH                 equ 0001h
C1FLTCON0U_FLTEN2_MASK                   equ 0080h
C1FLTCON0U_F2BP0_POSN                    equ 0000h
C1FLTCON0U_F2BP0_POSITION                equ 0000h
C1FLTCON0U_F2BP0_SIZE                    equ 0001h
C1FLTCON0U_F2BP0_LENGTH                  equ 0001h
C1FLTCON0U_F2BP0_MASK                    equ 0001h
C1FLTCON0U_F2BP1_POSN                    equ 0001h
C1FLTCON0U_F2BP1_POSITION                equ 0001h
C1FLTCON0U_F2BP1_SIZE                    equ 0001h
C1FLTCON0U_F2BP1_LENGTH                  equ 0001h
C1FLTCON0U_F2BP1_MASK                    equ 0002h
C1FLTCON0U_F2BP2_POSN                    equ 0002h
C1FLTCON0U_F2BP2_POSITION                equ 0002h
C1FLTCON0U_F2BP2_SIZE                    equ 0001h
C1FLTCON0U_F2BP2_LENGTH                  equ 0001h
C1FLTCON0U_F2BP2_MASK                    equ 0004h
C1FLTCON0U_F2BP3_POSN                    equ 0003h
C1FLTCON0U_F2BP3_POSITION                equ 0003h
C1FLTCON0U_F2BP3_SIZE                    equ 0001h
C1FLTCON0U_F2BP3_LENGTH                  equ 0001h
C1FLTCON0U_F2BP3_MASK                    equ 0008h
C1FLTCON0U_F2BP4_POSN                    equ 0004h
C1FLTCON0U_F2BP4_POSITION                equ 0004h
C1FLTCON0U_F2BP4_SIZE                    equ 0001h
C1FLTCON0U_F2BP4_LENGTH                  equ 0001h
C1FLTCON0U_F2BP4_MASK                    equ 0010h

// Register: C1FLTCON0T
#define C1FLTCON0T C1FLTCON0T
C1FLTCON0T                               equ 0183h
// bitfield definitions
C1FLTCON0T_F3BP_POSN                     equ 0000h
C1FLTCON0T_F3BP_POSITION                 equ 0000h
C1FLTCON0T_F3BP_SIZE                     equ 0005h
C1FLTCON0T_F3BP_LENGTH                   equ 0005h
C1FLTCON0T_F3BP_MASK                     equ 001Fh
C1FLTCON0T_FLTEN3_POSN                   equ 0007h
C1FLTCON0T_FLTEN3_POSITION               equ 0007h
C1FLTCON0T_FLTEN3_SIZE                   equ 0001h
C1FLTCON0T_FLTEN3_LENGTH                 equ 0001h
C1FLTCON0T_FLTEN3_MASK                   equ 0080h
C1FLTCON0T_F3BP0_POSN                    equ 0000h
C1FLTCON0T_F3BP0_POSITION                equ 0000h
C1FLTCON0T_F3BP0_SIZE                    equ 0001h
C1FLTCON0T_F3BP0_LENGTH                  equ 0001h
C1FLTCON0T_F3BP0_MASK                    equ 0001h
C1FLTCON0T_F3BP1_POSN                    equ 0001h
C1FLTCON0T_F3BP1_POSITION                equ 0001h
C1FLTCON0T_F3BP1_SIZE                    equ 0001h
C1FLTCON0T_F3BP1_LENGTH                  equ 0001h
C1FLTCON0T_F3BP1_MASK                    equ 0002h
C1FLTCON0T_F3BP2_POSN                    equ 0002h
C1FLTCON0T_F3BP2_POSITION                equ 0002h
C1FLTCON0T_F3BP2_SIZE                    equ 0001h
C1FLTCON0T_F3BP2_LENGTH                  equ 0001h
C1FLTCON0T_F3BP2_MASK                    equ 0004h
C1FLTCON0T_F3BP3_POSN                    equ 0003h
C1FLTCON0T_F3BP3_POSITION                equ 0003h
C1FLTCON0T_F3BP3_SIZE                    equ 0001h
C1FLTCON0T_F3BP3_LENGTH                  equ 0001h
C1FLTCON0T_F3BP3_MASK                    equ 0008h
C1FLTCON0T_F3BP4_POSN                    equ 0004h
C1FLTCON0T_F3BP4_POSITION                equ 0004h
C1FLTCON0T_F3BP4_SIZE                    equ 0001h
C1FLTCON0T_F3BP4_LENGTH                  equ 0001h
C1FLTCON0T_F3BP4_MASK                    equ 0010h

// Register: C1FLTCON1L
#define C1FLTCON1L C1FLTCON1L
C1FLTCON1L                               equ 0184h
// bitfield definitions
C1FLTCON1L_F4BP_POSN                     equ 0000h
C1FLTCON1L_F4BP_POSITION                 equ 0000h
C1FLTCON1L_F4BP_SIZE                     equ 0005h
C1FLTCON1L_F4BP_LENGTH                   equ 0005h
C1FLTCON1L_F4BP_MASK                     equ 001Fh
C1FLTCON1L_FLTEN4_POSN                   equ 0007h
C1FLTCON1L_FLTEN4_POSITION               equ 0007h
C1FLTCON1L_FLTEN4_SIZE                   equ 0001h
C1FLTCON1L_FLTEN4_LENGTH                 equ 0001h
C1FLTCON1L_FLTEN4_MASK                   equ 0080h
C1FLTCON1L_F4BP0_POSN                    equ 0000h
C1FLTCON1L_F4BP0_POSITION                equ 0000h
C1FLTCON1L_F4BP0_SIZE                    equ 0001h
C1FLTCON1L_F4BP0_LENGTH                  equ 0001h
C1FLTCON1L_F4BP0_MASK                    equ 0001h
C1FLTCON1L_F4BP1_POSN                    equ 0001h
C1FLTCON1L_F4BP1_POSITION                equ 0001h
C1FLTCON1L_F4BP1_SIZE                    equ 0001h
C1FLTCON1L_F4BP1_LENGTH                  equ 0001h
C1FLTCON1L_F4BP1_MASK                    equ 0002h
C1FLTCON1L_F4BP2_POSN                    equ 0002h
C1FLTCON1L_F4BP2_POSITION                equ 0002h
C1FLTCON1L_F4BP2_SIZE                    equ 0001h
C1FLTCON1L_F4BP2_LENGTH                  equ 0001h
C1FLTCON1L_F4BP2_MASK                    equ 0004h
C1FLTCON1L_F4BP3_POSN                    equ 0003h
C1FLTCON1L_F4BP3_POSITION                equ 0003h
C1FLTCON1L_F4BP3_SIZE                    equ 0001h
C1FLTCON1L_F4BP3_LENGTH                  equ 0001h
C1FLTCON1L_F4BP3_MASK                    equ 0008h
C1FLTCON1L_F4BP4_POSN                    equ 0004h
C1FLTCON1L_F4BP4_POSITION                equ 0004h
C1FLTCON1L_F4BP4_SIZE                    equ 0001h
C1FLTCON1L_F4BP4_LENGTH                  equ 0001h
C1FLTCON1L_F4BP4_MASK                    equ 0010h

