GopalSaraf/Practicals/PSDL/include/proc/pic18f47q83.inc
// Register: U3ERRIE
#define U3ERRIE U3ERRIE
U3ERRIE                                  equ 02D9h
// bitfield definitions
U3ERRIE_TXCIE_POSN                       equ 0000h
U3ERRIE_TXCIE_POSITION                   equ 0000h
U3ERRIE_TXCIE_SIZE                       equ 0001h
U3ERRIE_TXCIE_LENGTH                     equ 0001h
U3ERRIE_TXCIE_MASK                       equ 0001h
U3ERRIE_RXFOIE_POSN                      equ 0001h
U3ERRIE_RXFOIE_POSITION                  equ 0001h
U3ERRIE_RXFOIE_SIZE                      equ 0001h
U3ERRIE_RXFOIE_LENGTH                    equ 0001h
U3ERRIE_RXFOIE_MASK                      equ 0002h
U3ERRIE_RXBKIE_POSN                      equ 0002h
U3ERRIE_RXBKIE_POSITION                  equ 0002h
U3ERRIE_RXBKIE_SIZE                      equ 0001h
U3ERRIE_RXBKIE_LENGTH                    equ 0001h
U3ERRIE_RXBKIE_MASK                      equ 0004h
U3ERRIE_FERIE_POSN                       equ 0003h
U3ERRIE_FERIE_POSITION                   equ 0003h
U3ERRIE_FERIE_SIZE                       equ 0001h
U3ERRIE_FERIE_LENGTH                     equ 0001h
U3ERRIE_FERIE_MASK                       equ 0008h
U3ERRIE_CERIE_POSN                       equ 0004h
U3ERRIE_CERIE_POSITION                   equ 0004h
U3ERRIE_CERIE_SIZE                       equ 0001h
U3ERRIE_CERIE_LENGTH                     equ 0001h
U3ERRIE_CERIE_MASK                       equ 0010h
U3ERRIE_ABDOVE_POSN                      equ 0005h
U3ERRIE_ABDOVE_POSITION                  equ 0005h
U3ERRIE_ABDOVE_SIZE                      equ 0001h
U3ERRIE_ABDOVE_LENGTH                    equ 0001h
U3ERRIE_ABDOVE_MASK                      equ 0020h
U3ERRIE_PERIE_POSN                       equ 0006h
U3ERRIE_PERIE_POSITION                   equ 0006h
U3ERRIE_PERIE_SIZE                       equ 0001h
U3ERRIE_PERIE_LENGTH                     equ 0001h
U3ERRIE_PERIE_MASK                       equ 0040h
U3ERRIE_TXMTIE_POSN                      equ 0007h
U3ERRIE_TXMTIE_POSITION                  equ 0007h
U3ERRIE_TXMTIE_SIZE                      equ 0001h
U3ERRIE_TXMTIE_LENGTH                    equ 0001h
U3ERRIE_TXMTIE_MASK                      equ 0080h
U3ERRIE_U3TXCIE_POSN                     equ 0000h
U3ERRIE_U3TXCIE_POSITION                 equ 0000h
U3ERRIE_U3TXCIE_SIZE                     equ 0001h
U3ERRIE_U3TXCIE_LENGTH                   equ 0001h
U3ERRIE_U3TXCIE_MASK                     equ 0001h
U3ERRIE_U3RXFOIE_POSN                    equ 0001h
U3ERRIE_U3RXFOIE_POSITION                equ 0001h
U3ERRIE_U3RXFOIE_SIZE                    equ 0001h
U3ERRIE_U3RXFOIE_LENGTH                  equ 0001h
U3ERRIE_U3RXFOIE_MASK                    equ 0002h
U3ERRIE_U3RXBKIE_POSN                    equ 0002h
U3ERRIE_U3RXBKIE_POSITION                equ 0002h
U3ERRIE_U3RXBKIE_SIZE                    equ 0001h
U3ERRIE_U3RXBKIE_LENGTH                  equ 0001h
U3ERRIE_U3RXBKIE_MASK                    equ 0004h
U3ERRIE_U3FERIE_POSN                     equ 0003h
U3ERRIE_U3FERIE_POSITION                 equ 0003h
U3ERRIE_U3FERIE_SIZE                     equ 0001h
U3ERRIE_U3FERIE_LENGTH                   equ 0001h
U3ERRIE_U3FERIE_MASK                     equ 0008h
U3ERRIE_U3CERIE_POSN                     equ 0004h
U3ERRIE_U3CERIE_POSITION                 equ 0004h
U3ERRIE_U3CERIE_SIZE                     equ 0001h
U3ERRIE_U3CERIE_LENGTH                   equ 0001h
U3ERRIE_U3CERIE_MASK                     equ 0010h
U3ERRIE_U3ABDOVE_POSN                    equ 0005h
U3ERRIE_U3ABDOVE_POSITION                equ 0005h
U3ERRIE_U3ABDOVE_SIZE                    equ 0001h
U3ERRIE_U3ABDOVE_LENGTH                  equ 0001h
U3ERRIE_U3ABDOVE_MASK                    equ 0020h
U3ERRIE_U3PERIE_POSN                     equ 0006h
U3ERRIE_U3PERIE_POSITION                 equ 0006h
U3ERRIE_U3PERIE_SIZE                     equ 0001h
U3ERRIE_U3PERIE_LENGTH                   equ 0001h
U3ERRIE_U3PERIE_MASK                     equ 0040h
U3ERRIE_U3TXMTIE_POSN                    equ 0007h
U3ERRIE_U3TXMTIE_POSITION                equ 0007h
U3ERRIE_U3TXMTIE_SIZE                    equ 0001h
U3ERRIE_U3TXMTIE_LENGTH                  equ 0001h
U3ERRIE_U3TXMTIE_MASK                    equ 0080h

// Register: U4RXB
#define U4RXB U4RXB
U4RXB                                    equ 02DAh
// bitfield definitions
U4RXB_RXB_POSN                           equ 0000h
U4RXB_RXB_POSITION                       equ 0000h
U4RXB_RXB_SIZE                           equ 0008h
U4RXB_RXB_LENGTH                         equ 0008h
U4RXB_RXB_MASK                           equ 00FFh

// Register: U4TXB
#define U4TXB U4TXB
U4TXB                                    equ 02DCh
// bitfield definitions
U4TXB_TXB_POSN                           equ 0000h
U4TXB_TXB_POSITION                       equ 0000h
U4TXB_TXB_SIZE                           equ 0008h
U4TXB_TXB_LENGTH                         equ 0008h
U4TXB_TXB_MASK                           equ 00FFh

// Register: U4P1
#define U4P1 U4P1
U4P1                                     equ 02DEh

// Register: U4P1L
#define U4P1L U4P1L
U4P1L                                    equ 02DEh
// bitfield definitions
U4P1L_P1L_POSN                           equ 0000h
U4P1L_P1L_POSITION                       equ 0000h
U4P1L_P1L_SIZE                           equ 0008h
U4P1L_P1L_LENGTH                         equ 0008h
U4P1L_P1L_MASK                           equ 00FFh

// Register: U4P2
#define U4P2 U4P2
U4P2                                     equ 02E0h

// Register: U4P2L
#define U4P2L U4P2L
U4P2L                                    equ 02E0h
// bitfield definitions
U4P2L_P2L_POSN                           equ 0000h
U4P2L_P2L_POSITION                       equ 0000h
U4P2L_P2L_SIZE                           equ 0008h
U4P2L_P2L_LENGTH                         equ 0008h
U4P2L_P2L_MASK                           equ 00FFh

// Register: U4P3
#define U4P3 U4P3
U4P3                                     equ 02E2h

// Register: U4P3L
#define U4P3L U4P3L
U4P3L                                    equ 02E2h
// bitfield definitions
U4P3L_P3L_POSN                           equ 0000h
U4P3L_P3L_POSITION                       equ 0000h
U4P3L_P3L_SIZE                           equ 0008h
U4P3L_P3L_LENGTH                         equ 0008h
U4P3L_P3L_MASK                           equ 00FFh

// Register: U4CON0
#define U4CON0 U4CON0
U4CON0                                   equ 02E4h
// bitfield definitions
U4CON0_MODE0_POSN                        equ 0000h
U4CON0_MODE0_POSITION                    equ 0000h
U4CON0_MODE0_SIZE                        equ 0001h
U4CON0_MODE0_LENGTH                      equ 0001h
U4CON0_MODE0_MASK                        equ 0001h
U4CON0_MODE1_POSN                        equ 0001h
U4CON0_MODE1_POSITION                    equ 0001h
U4CON0_MODE1_SIZE                        equ 0001h
U4CON0_MODE1_LENGTH                      equ 0001h
U4CON0_MODE1_MASK                        equ 0002h
U4CON0_MODE2_POSN                        equ 0002h
U4CON0_MODE2_POSITION                    equ 0002h
U4CON0_MODE2_SIZE                        equ 0001h
U4CON0_MODE2_LENGTH                      equ 0001h
U4CON0_MODE2_MASK                        equ 0004h
U4CON0_U4MODE_POSN                       equ 0000h
U4CON0_U4MODE_POSITION                   equ 0000h
U4CON0_U4MODE_SIZE                       equ 0004h
U4CON0_U4MODE_LENGTH                     equ 0004h
U4CON0_U4MODE_MASK                       equ 000Fh
U4CON0_U4RXEN_POSN                       equ 0004h
U4CON0_U4RXEN_POSITION                   equ 0004h
U4CON0_U4RXEN_SIZE                       equ 0001h
U4CON0_U4RXEN_LENGTH                     equ 0001h
U4CON0_U4RXEN_MASK                       equ 0010h
U4CON0_U4TXEN_POSN                       equ 0005h
U4CON0_U4TXEN_POSITION                   equ 0005h
U4CON0_U4TXEN_SIZE                       equ 0001h
U4CON0_U4TXEN_LENGTH                     equ 0001h
U4CON0_U4TXEN_MASK                       equ 0020h
U4CON0_U4ABDEN_POSN                      equ 0006h
U4CON0_U4ABDEN_POSITION                  equ 0006h
U4CON0_U4ABDEN_SIZE                      equ 0001h
U4CON0_U4ABDEN_LENGTH                    equ 0001h
U4CON0_U4ABDEN_MASK                      equ 0040h
U4CON0_U4BRGS_POSN                       equ 0007h
U4CON0_U4BRGS_POSITION                   equ 0007h
U4CON0_U4BRGS_SIZE                       equ 0001h
U4CON0_U4BRGS_LENGTH                     equ 0001h
U4CON0_U4BRGS_MASK                       equ 0080h
U4CON0_U4MODE0_POSN                      equ 0000h
U4CON0_U4MODE0_POSITION                  equ 0000h
U4CON0_U4MODE0_SIZE                      equ 0001h
U4CON0_U4MODE0_LENGTH                    equ 0001h
U4CON0_U4MODE0_MASK                      equ 0001h
U4CON0_U4MODE1_POSN                      equ 0001h
U4CON0_U4MODE1_POSITION                  equ 0001h
U4CON0_U4MODE1_SIZE                      equ 0001h
U4CON0_U4MODE1_LENGTH                    equ 0001h
U4CON0_U4MODE1_MASK                      equ 0002h
U4CON0_U4MODE2_POSN                      equ 0002h
U4CON0_U4MODE2_POSITION                  equ 0002h
U4CON0_U4MODE2_SIZE                      equ 0001h
U4CON0_U4MODE2_LENGTH                    equ 0001h
U4CON0_U4MODE2_MASK                      equ 0004h
U4CON0_MODE_POSN                         equ 0000h
U4CON0_MODE_POSITION                     equ 0000h
U4CON0_MODE_SIZE                         equ 0004h
U4CON0_MODE_LENGTH                       equ 0004h
U4CON0_MODE_MASK                         equ 000Fh
U4CON0_RXEN_POSN                         equ 0004h
U4CON0_RXEN_POSITION                     equ 0004h
U4CON0_RXEN_SIZE                         equ 0001h
U4CON0_RXEN_LENGTH                       equ 0001h
U4CON0_RXEN_MASK                         equ 0010h
U4CON0_TXEN_POSN                         equ 0005h
U4CON0_TXEN_POSITION                     equ 0005h
U4CON0_TXEN_SIZE                         equ 0001h
U4CON0_TXEN_LENGTH                       equ 0001h
U4CON0_TXEN_MASK                         equ 0020h
U4CON0_ABDEN_POSN                        equ 0006h
U4CON0_ABDEN_POSITION                    equ 0006h
U4CON0_ABDEN_SIZE                        equ 0001h
U4CON0_ABDEN_LENGTH                      equ 0001h
U4CON0_ABDEN_MASK                        equ 0040h
U4CON0_BRGS_POSN                         equ 0007h
U4CON0_BRGS_POSITION                     equ 0007h
U4CON0_BRGS_SIZE                         equ 0001h
U4CON0_BRGS_LENGTH                       equ 0001h
U4CON0_BRGS_MASK                         equ 0080h

// Register: U4CON1
#define U4CON1 U4CON1
U4CON1                                   equ 02E5h
// bitfield definitions
U4CON1_SENDB_POSN                        equ 0000h
U4CON1_SENDB_POSITION                    equ 0000h
U4CON1_SENDB_SIZE                        equ 0001h
U4CON1_SENDB_LENGTH                      equ 0001h
U4CON1_SENDB_MASK                        equ 0001h
U4CON1_BRKOVR_POSN                       equ 0001h
U4CON1_BRKOVR_POSITION                   equ 0001h
U4CON1_BRKOVR_SIZE                       equ 0001h
U4CON1_BRKOVR_LENGTH                     equ 0001h
U4CON1_BRKOVR_MASK                       equ 0002h
U4CON1_RXBIMD_POSN                       equ 0003h
U4CON1_RXBIMD_POSITION                   equ 0003h
U4CON1_RXBIMD_SIZE                       equ 0001h
U4CON1_RXBIMD_LENGTH                     equ 0001h
U4CON1_RXBIMD_MASK                       equ 0008h
U4CON1_WUE_POSN                          equ 0004h
U4CON1_WUE_POSITION                      equ 0004h
U4CON1_WUE_SIZE                          equ 0001h
U4CON1_WUE_LENGTH                        equ 0001h
U4CON1_WUE_MASK                          equ 0010h
U4CON1_ON_POSN                           equ 0007h
U4CON1_ON_POSITION                       equ 0007h
U4CON1_ON_SIZE                           equ 0001h
U4CON1_ON_LENGTH                         equ 0001h
U4CON1_ON_MASK                           equ 0080h
U4CON1_U4SENDB_POSN                      equ 0000h
U4CON1_U4SENDB_POSITION                  equ 0000h
U4CON1_U4SENDB_SIZE                      equ 0001h
U4CON1_U4SENDB_LENGTH                    equ 0001h
U4CON1_U4SENDB_MASK                      equ 0001h
U4CON1_U4BRKOVR_POSN                     equ 0001h
U4CON1_U4BRKOVR_POSITION                 equ 0001h
U4CON1_U4BRKOVR_SIZE                     equ 0001h
U4CON1_U4BRKOVR_LENGTH                   equ 0001h
U4CON1_U4BRKOVR_MASK                     equ 0002h
U4CON1_U4RXBIMD_POSN                     equ 0003h
U4CON1_U4RXBIMD_POSITION                 equ 0003h
U4CON1_U4RXBIMD_SIZE                     equ 0001h
U4CON1_U4RXBIMD_LENGTH                   equ 0001h
U4CON1_U4RXBIMD_MASK                     equ 0008h
U4CON1_U4WUE_POSN                        equ 0004h
U4CON1_U4WUE_POSITION                    equ 0004h
U4CON1_U4WUE_SIZE                        equ 0001h
U4CON1_U4WUE_LENGTH                      equ 0001h
U4CON1_U4WUE_MASK                        equ 0010h
U4CON1_U4ON_POSN                         equ 0007h
U4CON1_U4ON_POSITION                     equ 0007h
U4CON1_U4ON_SIZE                         equ 0001h
U4CON1_U4ON_LENGTH                       equ 0001h
U4CON1_U4ON_MASK                         equ 0080h

// Register: U4CON2
#define U4CON2 U4CON2
U4CON2                                   equ 02E6h
// bitfield definitions
U4CON2_FLO_POSN                          equ 0000h
U4CON2_FLO_POSITION                      equ 0000h
U4CON2_FLO_SIZE                          equ 0002h
U4CON2_FLO_LENGTH                        equ 0002h
U4CON2_FLO_MASK                          equ 0003h
U4CON2_TXPOL_POSN                        equ 0002h
U4CON2_TXPOL_POSITION                    equ 0002h
U4CON2_TXPOL_SIZE                        equ 0001h
U4CON2_TXPOL_LENGTH                      equ 0001h
U4CON2_TXPOL_MASK                        equ 0004h
U4CON2_STP_POSN                          equ 0004h
U4CON2_STP_POSITION                      equ 0004h
U4CON2_STP_SIZE                          equ 0002h
U4CON2_STP_LENGTH                        equ 0002h
U4CON2_STP_MASK                          equ 0030h
U4CON2_RXPOL_POSN                        equ 0006h
U4CON2_RXPOL_POSITION                    equ 0006h
U4CON2_RXPOL_SIZE                        equ 0001h
U4CON2_RXPOL_LENGTH                      equ 0001h
U4CON2_RXPOL_MASK                        equ 0040h
U4CON2_RUNOVF_POSN                       equ 0007h
U4CON2_RUNOVF_POSITION                   equ 0007h
U4CON2_RUNOVF_SIZE                       equ 0001h
U4CON2_RUNOVF_LENGTH                     equ 0001h
U4CON2_RUNOVF_MASK                       equ 0080h
U4CON2_FLO0_POSN                         equ 0000h
U4CON2_FLO0_POSITION                     equ 0000h
U4CON2_FLO0_SIZE                         equ 0001h
U4CON2_FLO0_LENGTH                       equ 0001h
U4CON2_FLO0_MASK                         equ 0001h
U4CON2_FLO1_POSN                         equ 0001h
U4CON2_FLO1_POSITION                     equ 0001h
U4CON2_FLO1_SIZE                         equ 0001h
U4CON2_FLO1_LENGTH                       equ 0001h
U4CON2_FLO1_MASK                         equ 0002h
U4CON2_STP0_POSN                         equ 0004h
U4CON2_STP0_POSITION                     equ 0004h
U4CON2_STP0_SIZE                         equ 0001h
U4CON2_STP0_LENGTH                       equ 0001h
U4CON2_STP0_MASK                         equ 0010h
U4CON2_STP1_POSN                         equ 0005h
U4CON2_STP1_POSITION                     equ 0005h
U4CON2_STP1_SIZE                         equ 0001h
U4CON2_STP1_LENGTH                       equ 0001h
U4CON2_STP1_MASK                         equ 0020h
U4CON2_U4FLO_POSN                        equ 0000h
U4CON2_U4FLO_POSITION                    equ 0000h
U4CON2_U4FLO_SIZE                        equ 0002h
U4CON2_U4FLO_LENGTH                      equ 0002h
U4CON2_U4FLO_MASK                        equ 0003h
U4CON2_U4TXPOL_POSN                      equ 0002h
U4CON2_U4TXPOL_POSITION                  equ 0002h
U4CON2_U4TXPOL_SIZE                      equ 0001h
U4CON2_U4TXPOL_LENGTH                    equ 0001h
U4CON2_U4TXPOL_MASK                      equ 0004h
U4CON2_U4STP_POSN                        equ 0004h
U4CON2_U4STP_POSITION                    equ 0004h
U4CON2_U4STP_SIZE                        equ 0002h
U4CON2_U4STP_LENGTH                      equ 0002h
U4CON2_U4STP_MASK                        equ 0030h
U4CON2_U4RXPOL_POSN                      equ 0006h
U4CON2_U4RXPOL_POSITION                  equ 0006h
U4CON2_U4RXPOL_SIZE                      equ 0001h
U4CON2_U4RXPOL_LENGTH                    equ 0001h
U4CON2_U4RXPOL_MASK                      equ 0040h
U4CON2_U4RUNOVF_POSN                     equ 0007h
U4CON2_U4RUNOVF_POSITION                 equ 0007h
U4CON2_U4RUNOVF_SIZE                     equ 0001h
U4CON2_U4RUNOVF_LENGTH                   equ 0001h
U4CON2_U4RUNOVF_MASK                     equ 0080h
U4CON2_U4FLO0_POSN                       equ 0000h
U4CON2_U4FLO0_POSITION                   equ 0000h
U4CON2_U4FLO0_SIZE                       equ 0001h
U4CON2_U4FLO0_LENGTH                     equ 0001h
U4CON2_U4FLO0_MASK                       equ 0001h
U4CON2_U4FLO1_POSN                       equ 0001h
U4CON2_U4FLO1_POSITION                   equ 0001h
U4CON2_U4FLO1_SIZE                       equ 0001h
U4CON2_U4FLO1_LENGTH                     equ 0001h
U4CON2_U4FLO1_MASK                       equ 0002h
U4CON2_U4STP0_POSN                       equ 0004h
U4CON2_U4STP0_POSITION                   equ 0004h
U4CON2_U4STP0_SIZE                       equ 0001h
U4CON2_U4STP0_LENGTH                     equ 0001h
U4CON2_U4STP0_MASK                       equ 0010h
U4CON2_U4STP1_POSN                       equ 0005h
U4CON2_U4STP1_POSITION                   equ 0005h
U4CON2_U4STP1_SIZE                       equ 0001h
U4CON2_U4STP1_LENGTH                     equ 0001h
U4CON2_U4STP1_MASK                       equ 0020h

// Register: U4BRG
#define U4BRG U4BRG
U4BRG                                    equ 02E7h

// Register: U4BRGL
#define U4BRGL U4BRGL
U4BRGL                                   equ 02E7h
// bitfield definitions
U4BRGL_BRGL_POSN                         equ 0000h
U4BRGL_BRGL_POSITION                     equ 0000h
U4BRGL_BRGL_SIZE                         equ 0008h
U4BRGL_BRGL_LENGTH                       equ 0008h
U4BRGL_BRGL_MASK                         equ 00FFh

// Register: U4BRGH
#define U4BRGH U4BRGH
U4BRGH                                   equ 02E8h
// bitfield definitions
U4BRGH_BRGH_POSN                         equ 0000h
U4BRGH_BRGH_POSITION                     equ 0000h
U4BRGH_BRGH_SIZE                         equ 0008h
U4BRGH_BRGH_LENGTH                       equ 0008h
U4BRGH_BRGH_MASK                         equ 00FFh

// Register: U4FIFO
#define U4FIFO U4FIFO
U4FIFO                                   equ 02E9h
// bitfield definitions
U4FIFO_RXBF_POSN                         equ 0000h
U4FIFO_RXBF_POSITION                     equ 0000h
U4FIFO_RXBF_SIZE                         equ 0001h
U4FIFO_RXBF_LENGTH                       equ 0001h
U4FIFO_RXBF_MASK                         equ 0001h
U4FIFO_RXBE_POSN                         equ 0001h
U4FIFO_RXBE_POSITION                     equ 0001h
U4FIFO_RXBE_SIZE                         equ 0001h
U4FIFO_RXBE_LENGTH                       equ 0001h
U4FIFO_RXBE_MASK                         equ 0002h
U4FIFO_XON_POSN                          equ 0002h
U4FIFO_XON_POSITION                      equ 0002h
U4FIFO_XON_SIZE                          equ 0001h
U4FIFO_XON_LENGTH                        equ 0001h
U4FIFO_XON_MASK                          equ 0004h
U4FIFO_RXIDL_POSN                        equ 0003h
U4FIFO_RXIDL_POSITION                    equ 0003h
U4FIFO_RXIDL_SIZE                        equ 0001h
U4FIFO_RXIDL_LENGTH                      equ 0001h
U4FIFO_RXIDL_MASK                        equ 0008h
U4FIFO_TXBF_POSN                         equ 0004h
U4FIFO_TXBF_POSITION                     equ 0004h
U4FIFO_TXBF_SIZE                         equ 0001h
U4FIFO_TXBF_LENGTH                       equ 0001h
U4FIFO_TXBF_MASK                         equ 0010h
U4FIFO_TXBE_POSN                         equ 0005h
U4FIFO_TXBE_POSITION                     equ 0005h
U4FIFO_TXBE_SIZE                         equ 0001h
U4FIFO_TXBE_LENGTH                       equ 0001h
U4FIFO_TXBE_MASK                         equ 0020h
U4FIFO_STPMD_POSN                        equ 0006h
U4FIFO_STPMD_POSITION                    equ 0006h
U4FIFO_STPMD_SIZE                        equ 0001h
U4FIFO_STPMD_LENGTH                      equ 0001h
U4FIFO_STPMD_MASK                        equ 0040h
U4FIFO_TXWRE_POSN                        equ 0007h
U4FIFO_TXWRE_POSITION                    equ 0007h
U4FIFO_TXWRE_SIZE                        equ 0001h
U4FIFO_TXWRE_LENGTH                      equ 0001h
U4FIFO_TXWRE_MASK                        equ 0080h
U4FIFO_U4RXBF_POSN                       equ 0000h
U4FIFO_U4RXBF_POSITION                   equ 0000h
U4FIFO_U4RXBF_SIZE                       equ 0001h
U4FIFO_U4RXBF_LENGTH                     equ 0001h
U4FIFO_U4RXBF_MASK                       equ 0001h
U4FIFO_U4RXBE_POSN                       equ 0001h
U4FIFO_U4RXBE_POSITION                   equ 0001h
U4FIFO_U4RXBE_SIZE                       equ 0001h
U4FIFO_U4RXBE_LENGTH                     equ 0001h
U4FIFO_U4RXBE_MASK                       equ 0002h
U4FIFO_U4XON_POSN                        equ 0002h
U4FIFO_U4XON_POSITION                    equ 0002h
U4FIFO_U4XON_SIZE                        equ 0001h
U4FIFO_U4XON_LENGTH                      equ 0001h
U4FIFO_U4XON_MASK                        equ 0004h
U4FIFO_U4RXIDL_POSN                      equ 0003h
U4FIFO_U4RXIDL_POSITION                  equ 0003h
U4FIFO_U4RXIDL_SIZE                      equ 0001h
U4FIFO_U4RXIDL_LENGTH                    equ 0001h
U4FIFO_U4RXIDL_MASK                      equ 0008h
U4FIFO_U4TXBF_POSN                       equ 0004h
U4FIFO_U4TXBF_POSITION                   equ 0004h
U4FIFO_U4TXBF_SIZE                       equ 0001h
U4FIFO_U4TXBF_LENGTH                     equ 0001h
U4FIFO_U4TXBF_MASK                       equ 0010h
U4FIFO_U4TXBE_POSN                       equ 0005h
U4FIFO_U4TXBE_POSITION                   equ 0005h
U4FIFO_U4TXBE_SIZE                       equ 0001h
U4FIFO_U4TXBE_LENGTH                     equ 0001h
U4FIFO_U4TXBE_MASK                       equ 0020h
U4FIFO_U4STPMD_POSN                      equ 0006h
U4FIFO_U4STPMD_POSITION                  equ 0006h
U4FIFO_U4STPMD_SIZE                      equ 0001h
U4FIFO_U4STPMD_LENGTH                    equ 0001h
U4FIFO_U4STPMD_MASK                      equ 0040h
U4FIFO_U4TXWRE_POSN                      equ 0007h
U4FIFO_U4TXWRE_POSITION                  equ 0007h
U4FIFO_U4TXWRE_SIZE                      equ 0001h
U4FIFO_U4TXWRE_LENGTH                    equ 0001h
U4FIFO_U4TXWRE_MASK                      equ 0080h
U4FIFO_U4RCIDL_POSN                      equ 0003h
U4FIFO_U4RCIDL_POSITION                  equ 0003h
U4FIFO_U4RCIDL_SIZE                      equ 0001h
U4FIFO_U4RCIDL_LENGTH                    equ 0001h
U4FIFO_U4RCIDL_MASK                      equ 0008h
U4FIFO_RCIDL_POSN                        equ 0003h
U4FIFO_RCIDL_POSITION                    equ 0003h
U4FIFO_RCIDL_SIZE                        equ 0001h
U4FIFO_RCIDL_LENGTH                      equ 0001h
U4FIFO_RCIDL_MASK                        equ 0008h

