GopalSaraf/Practicals/PSDL/include/proc/pic18f47q83.inc
// Register: TU16BPRH
#define TU16BPRH TU16BPRH
TU16BPRH                                 equ 039Ah
// bitfield definitions
TU16BPRH_PRH_POSN                        equ 0000h
TU16BPRH_PRH_POSITION                    equ 0000h
TU16BPRH_PRH_SIZE                        equ 0008h
TU16BPRH_PRH_LENGTH                      equ 0008h
TU16BPRH_PRH_MASK                        equ 00FFh
TU16BPRH_PRH0_POSN                       equ 0000h
TU16BPRH_PRH0_POSITION                   equ 0000h
TU16BPRH_PRH0_SIZE                       equ 0001h
TU16BPRH_PRH0_LENGTH                     equ 0001h
TU16BPRH_PRH0_MASK                       equ 0001h
TU16BPRH_PRH1_POSN                       equ 0001h
TU16BPRH_PRH1_POSITION                   equ 0001h
TU16BPRH_PRH1_SIZE                       equ 0001h
TU16BPRH_PRH1_LENGTH                     equ 0001h
TU16BPRH_PRH1_MASK                       equ 0002h
TU16BPRH_PRH2_POSN                       equ 0002h
TU16BPRH_PRH2_POSITION                   equ 0002h
TU16BPRH_PRH2_SIZE                       equ 0001h
TU16BPRH_PRH2_LENGTH                     equ 0001h
TU16BPRH_PRH2_MASK                       equ 0004h
TU16BPRH_PRH3_POSN                       equ 0003h
TU16BPRH_PRH3_POSITION                   equ 0003h
TU16BPRH_PRH3_SIZE                       equ 0001h
TU16BPRH_PRH3_LENGTH                     equ 0001h
TU16BPRH_PRH3_MASK                       equ 0008h
TU16BPRH_PRH4_POSN                       equ 0004h
TU16BPRH_PRH4_POSITION                   equ 0004h
TU16BPRH_PRH4_SIZE                       equ 0001h
TU16BPRH_PRH4_LENGTH                     equ 0001h
TU16BPRH_PRH4_MASK                       equ 0010h
TU16BPRH_PRH5_POSN                       equ 0005h
TU16BPRH_PRH5_POSITION                   equ 0005h
TU16BPRH_PRH5_SIZE                       equ 0001h
TU16BPRH_PRH5_LENGTH                     equ 0001h
TU16BPRH_PRH5_MASK                       equ 0020h
TU16BPRH_PRH6_POSN                       equ 0006h
TU16BPRH_PRH6_POSITION                   equ 0006h
TU16BPRH_PRH6_SIZE                       equ 0001h
TU16BPRH_PRH6_LENGTH                     equ 0001h
TU16BPRH_PRH6_MASK                       equ 0040h
TU16BPRH_PRH7_POSN                       equ 0007h
TU16BPRH_PRH7_POSITION                   equ 0007h
TU16BPRH_PRH7_SIZE                       equ 0001h
TU16BPRH_PRH7_LENGTH                     equ 0001h
TU16BPRH_PRH7_MASK                       equ 0080h
TU16BPRH_TU16BPRH0_POSN                  equ 0000h
TU16BPRH_TU16BPRH0_POSITION              equ 0000h
TU16BPRH_TU16BPRH0_SIZE                  equ 0001h
TU16BPRH_TU16BPRH0_LENGTH                equ 0001h
TU16BPRH_TU16BPRH0_MASK                  equ 0001h
TU16BPRH_TU16BPRH1_POSN                  equ 0001h
TU16BPRH_TU16BPRH1_POSITION              equ 0001h
TU16BPRH_TU16BPRH1_SIZE                  equ 0001h
TU16BPRH_TU16BPRH1_LENGTH                equ 0001h
TU16BPRH_TU16BPRH1_MASK                  equ 0002h
TU16BPRH_TU16BPRH2_POSN                  equ 0002h
TU16BPRH_TU16BPRH2_POSITION              equ 0002h
TU16BPRH_TU16BPRH2_SIZE                  equ 0001h
TU16BPRH_TU16BPRH2_LENGTH                equ 0001h
TU16BPRH_TU16BPRH2_MASK                  equ 0004h
TU16BPRH_TU16BPRH3_POSN                  equ 0003h
TU16BPRH_TU16BPRH3_POSITION              equ 0003h
TU16BPRH_TU16BPRH3_SIZE                  equ 0001h
TU16BPRH_TU16BPRH3_LENGTH                equ 0001h
TU16BPRH_TU16BPRH3_MASK                  equ 0008h
TU16BPRH_TU16BPRH4_POSN                  equ 0004h
TU16BPRH_TU16BPRH4_POSITION              equ 0004h
TU16BPRH_TU16BPRH4_SIZE                  equ 0001h
TU16BPRH_TU16BPRH4_LENGTH                equ 0001h
TU16BPRH_TU16BPRH4_MASK                  equ 0010h
TU16BPRH_TU16BPRH5_POSN                  equ 0005h
TU16BPRH_TU16BPRH5_POSITION              equ 0005h
TU16BPRH_TU16BPRH5_SIZE                  equ 0001h
TU16BPRH_TU16BPRH5_LENGTH                equ 0001h
TU16BPRH_TU16BPRH5_MASK                  equ 0020h
TU16BPRH_TU16BPRH6_POSN                  equ 0006h
TU16BPRH_TU16BPRH6_POSITION              equ 0006h
TU16BPRH_TU16BPRH6_SIZE                  equ 0001h
TU16BPRH_TU16BPRH6_LENGTH                equ 0001h
TU16BPRH_TU16BPRH6_MASK                  equ 0040h
TU16BPRH_TU16BPRH7_POSN                  equ 0007h
TU16BPRH_TU16BPRH7_POSITION              equ 0007h
TU16BPRH_TU16BPRH7_SIZE                  equ 0001h
TU16BPRH_TU16BPRH7_LENGTH                equ 0001h
TU16BPRH_TU16BPRH7_MASK                  equ 0080h
TU16BPRH_TU16BPR8_POSN                   equ 0000h
TU16BPRH_TU16BPR8_POSITION               equ 0000h
TU16BPRH_TU16BPR8_SIZE                   equ 0001h
TU16BPRH_TU16BPR8_LENGTH                 equ 0001h
TU16BPRH_TU16BPR8_MASK                   equ 0001h
TU16BPRH_TU16BPR9_POSN                   equ 0001h
TU16BPRH_TU16BPR9_POSITION               equ 0001h
TU16BPRH_TU16BPR9_SIZE                   equ 0001h
TU16BPRH_TU16BPR9_LENGTH                 equ 0001h
TU16BPRH_TU16BPR9_MASK                   equ 0002h
TU16BPRH_TU16BPR10_POSN                  equ 0002h
TU16BPRH_TU16BPR10_POSITION              equ 0002h
TU16BPRH_TU16BPR10_SIZE                  equ 0001h
TU16BPRH_TU16BPR10_LENGTH                equ 0001h
TU16BPRH_TU16BPR10_MASK                  equ 0004h
TU16BPRH_TU16BPR11_POSN                  equ 0003h
TU16BPRH_TU16BPR11_POSITION              equ 0003h
TU16BPRH_TU16BPR11_SIZE                  equ 0001h
TU16BPRH_TU16BPR11_LENGTH                equ 0001h
TU16BPRH_TU16BPR11_MASK                  equ 0008h
TU16BPRH_TU16BPR12_POSN                  equ 0004h
TU16BPRH_TU16BPR12_POSITION              equ 0004h
TU16BPRH_TU16BPR12_SIZE                  equ 0001h
TU16BPRH_TU16BPR12_LENGTH                equ 0001h
TU16BPRH_TU16BPR12_MASK                  equ 0010h
TU16BPRH_TU16BPR13_POSN                  equ 0005h
TU16BPRH_TU16BPR13_POSITION              equ 0005h
TU16BPRH_TU16BPR13_SIZE                  equ 0001h
TU16BPRH_TU16BPR13_LENGTH                equ 0001h
TU16BPRH_TU16BPR13_MASK                  equ 0020h
TU16BPRH_TU16BPR14_POSN                  equ 0006h
TU16BPRH_TU16BPR14_POSITION              equ 0006h
TU16BPRH_TU16BPR14_SIZE                  equ 0001h
TU16BPRH_TU16BPR14_LENGTH                equ 0001h
TU16BPRH_TU16BPR14_MASK                  equ 0040h
TU16BPRH_TU16BPR15_POSN                  equ 0007h
TU16BPRH_TU16BPR15_POSITION              equ 0007h
TU16BPRH_TU16BPR15_SIZE                  equ 0001h
TU16BPRH_TU16BPR15_LENGTH                equ 0001h
TU16BPRH_TU16BPR15_MASK                  equ 0080h

