GopalSaraf/Practicals/PSDL/include/proc/pic18f47q83.inc
#define T4MODE3                          BANKMASK(T4HLT), 3, b
#define T4MODE4                          BANKMASK(T4HLT), 4, b
#define T4ON                             BANKMASK(T4CON), 7, b
#define T4OUTPS0                         BANKMASK(T4CON), 0, b
#define T4OUTPS1                         BANKMASK(T4CON), 1, b
#define T4OUTPS2                         BANKMASK(T4CON), 2, b
#define T4OUTPS3                         BANKMASK(T4CON), 3, b
#define T4PSYNC                          BANKMASK(T4HLT), 7, b
#define T4RSEL0                          BANKMASK(T4RST), 0, b
#define T4RSEL1                          BANKMASK(T4RST), 1, b
#define T4RSEL2                          BANKMASK(T4RST), 2, b
#define T4RSEL3                          BANKMASK(T4RST), 3, b
#define T4RSEL4                          BANKMASK(T4RST), 4, b
#define T5CKIPPS0                        BANKMASK(T5CKIPPS), 0, b
#define T5CKIPPS1                        BANKMASK(T5CKIPPS), 1, b
#define T5CKIPPS2                        BANKMASK(T5CKIPPS), 2, b
#define T5CKIPPS3                        BANKMASK(T5CKIPPS), 3, b
#define T5CKIPPS4                        BANKMASK(T5CKIPPS), 4, b
#define T5CKIPPS5                        BANKMASK(T5CKIPPS), 5, b
#define T5CKPS0                          BANKMASK(T5CON), 4, b
#define T5CKPS1                          BANKMASK(T5CON), 5, b
#define T5CS0                            BANKMASK(T5CLK), 0, b
#define T5CS1                            BANKMASK(T5CLK), 1, b
#define T5CS2                            BANKMASK(T5CLK), 2, b
#define T5CS3                            BANKMASK(T5CLK), 3, b
#define T5CS4                            BANKMASK(T5CLK), 4, b
#define T5GE                             BANKMASK(T5GCON), 7, b
#define T5GGO                            BANKMASK(T5GCON), 3, b
#define T5GPOL                           BANKMASK(T5GCON), 6, b
#define T5GPPS0                          BANKMASK(T5GPPS), 0, b
#define T5GPPS1                          BANKMASK(T5GPPS), 1, b
#define T5GPPS2                          BANKMASK(T5GPPS), 2, b
#define T5GPPS3                          BANKMASK(T5GPPS), 3, b
#define T5GPPS4                          BANKMASK(T5GPPS), 4, b
#define T5GSPM                           BANKMASK(T5GCON), 4, b
#define T5GSS0                           BANKMASK(T5GATE), 0, b
#define T5GSS1                           BANKMASK(T5GATE), 1, b
#define T5GSS2                           BANKMASK(T5GATE), 2, b
#define T5GSS3                           BANKMASK(T5GATE), 3, b
#define T5GSS4                           BANKMASK(T5GATE), 4, b
#define T5GTM                            BANKMASK(T5GCON), 5, b
#define T5GVAL                           BANKMASK(T5GCON), 2, b
#define T5RD16                           BANKMASK(T5CON), 1, b
#define T6CKPOL                          BANKMASK(T6HLT), 6, b
#define T6CKPS0                          BANKMASK(T6CON), 4, b
#define T6CKPS1                          BANKMASK(T6CON), 5, b
#define T6CKPS2                          BANKMASK(T6CON), 6, b
#define T6CKSYNC                         BANKMASK(T6HLT), 5, b
#define T6CS0                            BANKMASK(T6CLKCON), 0, b
#define T6CS1                            BANKMASK(T6CLKCON), 1, b
#define T6CS2                            BANKMASK(T6CLKCON), 2, b
#define T6CS3                            BANKMASK(T6CLKCON), 3, b
#define T6INPPS0                         BANKMASK(T6INPPS), 0, b
#define T6INPPS1                         BANKMASK(T6INPPS), 1, b
#define T6INPPS2                         BANKMASK(T6INPPS), 2, b
#define T6INPPS3                         BANKMASK(T6INPPS), 3, b
#define T6INPPS4                         BANKMASK(T6INPPS), 4, b
#define T6MODE0                          BANKMASK(T6HLT), 0, b
#define T6MODE1                          BANKMASK(T6HLT), 1, b
#define T6MODE2                          BANKMASK(T6HLT), 2, b
#define T6MODE3                          BANKMASK(T6HLT), 3, b
#define T6MODE4                          BANKMASK(T6HLT), 4, b
#define T6ON                             BANKMASK(T6CON), 7, b
#define T6OUTPS0                         BANKMASK(T6CON), 0, b
#define T6OUTPS1                         BANKMASK(T6CON), 1, b
#define T6OUTPS2                         BANKMASK(T6CON), 2, b
#define T6OUTPS3                         BANKMASK(T6CON), 3, b
#define T6PSYNC                          BANKMASK(T6HLT), 7, b
#define T6RSEL0                          BANKMASK(T6RST), 0, b
#define T6RSEL1                          BANKMASK(T6RST), 1, b
#define T6RSEL2                          BANKMASK(T6RST), 2, b
#define T6RSEL3                          BANKMASK(T6RST), 3, b
#define T6RSEL4                          BANKMASK(T6RST), 4, b
#define TBC0                             BANKMASK(C1TBCL), 0, b
#define TBC1                             BANKMASK(C1TBCL), 1, b
#define TBC10                            BANKMASK(C1TBCH), 2, b
#define TBC11                            BANKMASK(C1TBCH), 3, b
#define TBC12                            BANKMASK(C1TBCH), 4, b
#define TBC13                            BANKMASK(C1TBCH), 5, b
#define TBC14                            BANKMASK(C1TBCH), 6, b
#define TBC15                            BANKMASK(C1TBCH), 7, b
#define TBC16                            BANKMASK(C1TBCU), 0, b
#define TBC17                            BANKMASK(C1TBCU), 1, b
#define TBC18                            BANKMASK(C1TBCU), 2, b
#define TBC19                            BANKMASK(C1TBCU), 3, b
#define TBC2                             BANKMASK(C1TBCL), 2, b
#define TBC20                            BANKMASK(C1TBCU), 4, b
#define TBC21                            BANKMASK(C1TBCU), 5, b
#define TBC22                            BANKMASK(C1TBCU), 6, b
#define TBC23                            BANKMASK(C1TBCU), 7, b
#define TBC24                            BANKMASK(C1TBCT), 0, b
#define TBC25                            BANKMASK(C1TBCT), 1, b
#define TBC26                            BANKMASK(C1TBCT), 2, b
#define TBC27                            BANKMASK(C1TBCT), 3, b
#define TBC28                            BANKMASK(C1TBCT), 4, b
#define TBC29                            BANKMASK(C1TBCT), 5, b
#define TBC3                             BANKMASK(C1TBCL), 3, b
#define TBC30                            BANKMASK(C1TBCT), 6, b
#define TBC31                            BANKMASK(C1TBCT), 7, b
#define TBC4                             BANKMASK(C1TBCL), 4, b
#define TBC5                             BANKMASK(C1TBCL), 5, b
#define TBC6                             BANKMASK(C1TBCL), 6, b
#define TBC7                             BANKMASK(C1TBCL), 7, b
#define TBC8                             BANKMASK(C1TBCH), 0, b
#define TBC9                             BANKMASK(C1TBCH), 1, b
#define TBCEN                            BANKMASK(C1TSCONU), 0, b
#define TBCIE                            BANKMASK(C1INTU), 2, b
#define TBCIF                            BANKMASK(C1INTL), 2, b
#define TBCPRE0                          BANKMASK(C1TSCONL), 0, b
#define TBCPRE1                          BANKMASK(C1TSCONL), 1, b
#define TBCPRE2                          BANKMASK(C1TSCONL), 2, b
#define TBCPRE3                          BANKMASK(C1TSCONL), 3, b
#define TBCPRE4                          BANKMASK(C1TSCONL), 4, b
#define TBCPRE5                          BANKMASK(C1TSCONL), 5, b
#define TBCPRE6                          BANKMASK(C1TSCONL), 6, b
#define TBCPRE7                          BANKMASK(C1TSCONL), 7, b
#define TBCPRE8                          BANKMASK(C1TSCONH), 0, b
#define TBCPRE9                          BANKMASK(C1TSCONH), 1, b
#define TDCMOD0                          BANKMASK(C1TDCU), 0, b
#define TDCMOD1                          BANKMASK(C1TDCU), 1, b
#define TDCO0                            BANKMASK(C1TDCH), 0, b
#define TDCO1                            BANKMASK(C1TDCH), 1, b
#define TDCO2                            BANKMASK(C1TDCH), 2, b
#define TDCO3                            BANKMASK(C1TDCH), 3, b
#define TDCO4                            BANKMASK(C1TDCH), 4, b
#define TDCO5                            BANKMASK(C1TDCH), 5, b
#define TDCO6                            BANKMASK(C1TDCH), 6, b
#define TDCV0                            BANKMASK(C1TDCL), 0, b
#define TDCV1                            BANKMASK(C1TDCL), 1, b
#define TDCV2                            BANKMASK(C1TDCL), 2, b
#define TDCV3                            BANKMASK(C1TDCL), 3, b
#define TDCV4                            BANKMASK(C1TDCL), 4, b
#define TDCV5                            BANKMASK(C1TDCL), 5, b
#define TEFFIE                           BANKMASK(C1TEFCONL), 2, b
#define TEFFIF                           BANKMASK(C1TEFSTAL), 2, b
#define TEFHIE                           BANKMASK(C1TEFCONL), 1, b
#define TEFHIF                           BANKMASK(C1TEFSTAL), 1, b
#define TEFIE                            BANKMASK(C1INTU), 4, b
#define TEFIF                            BANKMASK(C1INTL), 4, b
#define TEFNEIE                          BANKMASK(C1TEFCONL), 0, b
#define TEFNEIF                          BANKMASK(C1TEFSTAL), 0, b
#define TEFOVIE                          BANKMASK(C1TEFCONL), 3, b
#define TEFOVIF                          BANKMASK(C1TEFSTAL), 3, b
#define TEFTSEN                          BANKMASK(C1TEFCONL), 5, b
#define TEFUA0                           BANKMASK(C1TEFUAL), 0, b
#define TEFUA1                           BANKMASK(C1TEFUAL), 1, b
#define TEFUA10                          BANKMASK(C1TEFUAH), 2, b
#define TEFUA11                          BANKMASK(C1TEFUAH), 3, b
#define TEFUA12                          BANKMASK(C1TEFUAH), 4, b
#define TEFUA13                          BANKMASK(C1TEFUAH), 5, b
#define TEFUA14                          BANKMASK(C1TEFUAH), 6, b
#define TEFUA15                          BANKMASK(C1TEFUAH), 7, b
#define TEFUA16                          BANKMASK(C1TEFUAU), 0, b
#define TEFUA17                          BANKMASK(C1TEFUAU), 1, b
#define TEFUA18                          BANKMASK(C1TEFUAU), 2, b
#define TEFUA19                          BANKMASK(C1TEFUAU), 3, b
#define TEFUA2                           BANKMASK(C1TEFUAL), 2, b
#define TEFUA20                          BANKMASK(C1TEFUAU), 4, b
#define TEFUA21                          BANKMASK(C1TEFUAU), 5, b
#define TEFUA22                          BANKMASK(C1TEFUAU), 6, b
#define TEFUA23                          BANKMASK(C1TEFUAU), 7, b
#define TEFUA24                          BANKMASK(C1TEFUAT), 0, b
#define TEFUA25                          BANKMASK(C1TEFUAT), 1, b
#define TEFUA26                          BANKMASK(C1TEFUAT), 2, b
#define TEFUA27                          BANKMASK(C1TEFUAT), 3, b
#define TEFUA28                          BANKMASK(C1TEFUAT), 4, b
#define TEFUA29                          BANKMASK(C1TEFUAT), 5, b
#define TEFUA3                           BANKMASK(C1TEFUAL), 3, b
#define TEFUA30                          BANKMASK(C1TEFUAT), 6, b
#define TEFUA31                          BANKMASK(C1TEFUAT), 7, b
#define TEFUA4                           BANKMASK(C1TEFUAL), 4, b
#define TEFUA5                           BANKMASK(C1TEFUAL), 5, b
#define TEFUA6                           BANKMASK(C1TEFUAL), 6, b
#define TEFUA7                           BANKMASK(C1TEFUAL), 7, b
#define TEFUA8                           BANKMASK(C1TEFUAH), 0, b
#define TEFUA9                           BANKMASK(C1TEFUAH), 1, b
#define TERRCNT0                         BANKMASK(C1TRECH), 0, b
#define TERRCNT1                         BANKMASK(C1TRECH), 1, b
#define TERRCNT2                         BANKMASK(C1TRECH), 2, b
#define TERRCNT3                         BANKMASK(C1TRECH), 3, b
#define TERRCNT4                         BANKMASK(C1TRECH), 4, b
#define TERRCNT5                         BANKMASK(C1TRECH), 5, b
#define TERRCNT6                         BANKMASK(C1TRECH), 6, b
#define TERRCNT7                         BANKMASK(C1TRECH), 7, b
#define TFATIF0                          BANKMASK(C1TXATIFL), 0, b
#define TFATIF1                          BANKMASK(C1TXATIFL), 1, b
#define TFATIF10                         BANKMASK(C1TXATIFH), 2, b
#define TFATIF11                         BANKMASK(C1TXATIFH), 3, b
#define TFATIF12                         BANKMASK(C1TXATIFH), 4, b
#define TFATIF13                         BANKMASK(C1TXATIFH), 5, b
#define TFATIF14                         BANKMASK(C1TXATIFH), 6, b
#define TFATIF15                         BANKMASK(C1TXATIFH), 7, b
#define TFATIF16                         BANKMASK(C1TXATIFU), 0, b
#define TFATIF17                         BANKMASK(C1TXATIFU), 1, b
#define TFATIF18                         BANKMASK(C1TXATIFU), 2, b
#define TFATIF19                         BANKMASK(C1TXATIFU), 3, b
#define TFATIF2                          BANKMASK(C1TXATIFL), 2, b
#define TFATIF20                         BANKMASK(C1TXATIFU), 4, b
#define TFATIF21                         BANKMASK(C1TXATIFU), 5, b
#define TFATIF22                         BANKMASK(C1TXATIFU), 6, b
#define TFATIF23                         BANKMASK(C1TXATIFU), 7, b
#define TFATIF24                         BANKMASK(C1TXATIFT), 0, b
#define TFATIF25                         BANKMASK(C1TXATIFT), 1, b
#define TFATIF26                         BANKMASK(C1TXATIFT), 2, b
#define TFATIF27                         BANKMASK(C1TXATIFT), 3, b
#define TFATIF28                         BANKMASK(C1TXATIFT), 4, b
#define TFATIF29                         BANKMASK(C1TXATIFT), 5, b
#define TFATIF3                          BANKMASK(C1TXATIFL), 3, b
#define TFATIF30                         BANKMASK(C1TXATIFT), 6, b
#define TFATIF31                         BANKMASK(C1TXATIFT), 7, b
#define TFATIF4                          BANKMASK(C1TXATIFL), 4, b
#define TFATIF5                          BANKMASK(C1TXATIFL), 5, b
#define TFATIF6                          BANKMASK(C1TXATIFL), 6, b
#define TFATIF7                          BANKMASK(C1TXATIFL), 7, b
#define TFATIF8                          BANKMASK(C1TXATIFH), 0, b
#define TFATIF9                          BANKMASK(C1TXATIFH), 1, b
#define TFIF0                            BANKMASK(C1TXIFL), 0, b
#define TFIF1                            BANKMASK(C1TXIFL), 1, b
#define TFIF10                           BANKMASK(C1TXIFH), 2, b
#define TFIF11                           BANKMASK(C1TXIFH), 3, b
#define TFIF12                           BANKMASK(C1TXIFH), 4, b
#define TFIF13                           BANKMASK(C1TXIFH), 5, b
#define TFIF14                           BANKMASK(C1TXIFH), 6, b
#define TFIF15                           BANKMASK(C1TXIFH), 7, b
#define TFIF16                           BANKMASK(C1TXIFU), 0, b
#define TFIF17                           BANKMASK(C1TXIFU), 1, b
#define TFIF18                           BANKMASK(C1TXIFU), 2, b
#define TFIF19                           BANKMASK(C1TXIFU), 3, b
#define TFIF2                            BANKMASK(C1TXIFL), 2, b
#define TFIF20                           BANKMASK(C1TXIFU), 4, b
#define TFIF21                           BANKMASK(C1TXIFU), 5, b
#define TFIF22                           BANKMASK(C1TXIFU), 6, b
#define TFIF23                           BANKMASK(C1TXIFU), 7, b
#define TFIF24                           BANKMASK(C1TXIFT), 0, b
#define TFIF25                           BANKMASK(C1TXIFT), 1, b
#define TFIF26                           BANKMASK(C1TXIFT), 2, b
#define TFIF27                           BANKMASK(C1TXIFT), 3, b
#define TFIF28                           BANKMASK(C1TXIFT), 4, b
#define TFIF29                           BANKMASK(C1TXIFT), 5, b
#define TFIF3                            BANKMASK(C1TXIFL), 3, b
#define TFIF30                           BANKMASK(C1TXIFT), 6, b
#define TFIF31                           BANKMASK(C1TXIFT), 7, b
#define TFIF4                            BANKMASK(C1TXIFL), 4, b
#define TFIF5                            BANKMASK(C1TXIFL), 5, b
#define TFIF6                            BANKMASK(C1TXIFL), 6, b
#define TFIF7                            BANKMASK(C1TXIFL), 7, b
#define TFIF8                            BANKMASK(C1TXIFH), 0, b
#define TFIF9                            BANKMASK(C1TXIFH), 1, b
#define TMD0                             BANKMASK(ADCON3), 0, b
#define TMD1                             BANKMASK(ADCON3), 1, b
#define TMD2                             BANKMASK(ADCON3), 2, b
#define TMR0                             BANKMASK(SMT1TMRL), 0, b
#define TMR0H0                           BANKMASK(TMR0H), 0, b
#define TMR0H1                           BANKMASK(TMR0H), 1, b
#define TMR0H2                           BANKMASK(TMR0H), 2, b
#define TMR0H3                           BANKMASK(TMR0H), 3, b
#define TMR0H4                           BANKMASK(TMR0H), 4, b
#define TMR0H5                           BANKMASK(TMR0H), 5, b
#define TMR0H6                           BANKMASK(TMR0H), 6, b
#define TMR0H7                           BANKMASK(TMR0H), 7, b
#define TMR0IE                           BANKMASK(PIE3), 7, a
#define TMR0IF                           BANKMASK(PIR3), 7, a
#define TMR0IP                           BANKMASK(IPR3), 7, b
#define TMR0L0                           BANKMASK(TMR0L), 0, b
#define TMR0L1                           BANKMASK(TMR0L), 1, b
#define TMR0L2                           BANKMASK(TMR0L), 2, b
#define TMR0L3                           BANKMASK(TMR0L), 3, b
#define TMR0L4                           BANKMASK(TMR0L), 4, b
#define TMR0L5                           BANKMASK(TMR0L), 5, b
#define TMR0L6                           BANKMASK(TMR0L), 6, b
#define TMR0L7                           BANKMASK(TMR0L), 7, b
#define TMR0MD                           BANKMASK(PMD1), 0, b
#define TMR1                             BANKMASK(SMT1TMRL), 1, b
#define TMR10                            BANKMASK(SMT1TMRH), 2, b
#define TMR11                            BANKMASK(SMT1TMRH), 3, b
#define TMR12                            BANKMASK(SMT1TMRH), 4, b
#define TMR13                            BANKMASK(SMT1TMRH), 5, b
#define TMR14                            BANKMASK(SMT1TMRH), 6, b
#define TMR15                            BANKMASK(SMT1TMRH), 7, b
#define TMR16                            BANKMASK(SMT1TMRU), 0, b
#define TMR17                            BANKMASK(SMT1TMRU), 1, b
#define TMR18                            BANKMASK(SMT1TMRU), 2, b
#define TMR19                            BANKMASK(SMT1TMRU), 3, b
#define TMR1GIE                          BANKMASK(PIE3), 5, a
#define TMR1GIF                          BANKMASK(PIR3), 5, a
#define TMR1GIP                          BANKMASK(IPR3), 5, b
#define TMR1H0                           BANKMASK(TMR1H), 0, b
#define TMR1H1                           BANKMASK(TMR1H), 1, b
#define TMR1H2                           BANKMASK(TMR1H), 2, b
#define TMR1H3                           BANKMASK(TMR1H), 3, b
#define TMR1H4                           BANKMASK(TMR1H), 4, b
#define TMR1H5                           BANKMASK(TMR1H), 5, b
#define TMR1H6                           BANKMASK(TMR1H), 6, b
#define TMR1H7                           BANKMASK(TMR1H), 7, b
#define TMR1IE                           BANKMASK(PIE3), 4, a
#define TMR1IF                           BANKMASK(PIR3), 4, a
#define TMR1IP                           BANKMASK(IPR3), 4, b
#define TMR1L0                           BANKMASK(TMR1L), 0, b
#define TMR1L1                           BANKMASK(TMR1L), 1, b
#define TMR1L2                           BANKMASK(TMR1L), 2, b
#define TMR1L3                           BANKMASK(TMR1L), 3, b
#define TMR1L4                           BANKMASK(TMR1L), 4, b
#define TMR1L5                           BANKMASK(TMR1L), 5, b
#define TMR1L6                           BANKMASK(TMR1L), 6, b
#define TMR1L7                           BANKMASK(TMR1L), 7, b
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, b
#define TMR2                             BANKMASK(SMT1TMRL), 2, b
#define TMR20                            BANKMASK(SMT1TMRU), 4, b
#define TMR21                            BANKMASK(SMT1TMRU), 5, b
#define TMR22                            BANKMASK(SMT1TMRU), 6, b
#define TMR23                            BANKMASK(SMT1TMRU), 7, b
#define TMR2IE                           BANKMASK(PIE3), 3, a
#define TMR2IF                           BANKMASK(PIR3), 3, a
#define TMR2IP                           BANKMASK(IPR3), 3, b
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 7, b
#define TMR3                             BANKMASK(SMT1TMRL), 3, b
#define TMR3GIE                          BANKMASK(PIE5), 5, a
#define TMR3GIF                          BANKMASK(PIR5), 5, a
#define TMR3GIP                          BANKMASK(IPR5), 5, b
#define TMR3H0                           BANKMASK(TMR3H), 0, b
#define TMR3H1                           BANKMASK(TMR3H), 1, b
#define TMR3H2                           BANKMASK(TMR3H), 2, b
#define TMR3H3                           BANKMASK(TMR3H), 3, b
#define TMR3H4                           BANKMASK(TMR3H), 4, b
#define TMR3H5                           BANKMASK(TMR3H), 5, b
#define TMR3H6                           BANKMASK(TMR3H), 6, b
#define TMR3H7                           BANKMASK(TMR3H), 7, b
#define TMR3IE                           BANKMASK(PIE5), 4, a
#define TMR3IF                           BANKMASK(PIR5), 4, a
#define TMR3IP                           BANKMASK(IPR5), 4, b
#define TMR3L0                           BANKMASK(TMR3L), 0, b
#define TMR3L1                           BANKMASK(TMR3L), 1, b
#define TMR3L2                           BANKMASK(TMR3L), 2, b
#define TMR3L3                           BANKMASK(TMR3L), 3, b
#define TMR3L4                           BANKMASK(TMR3L), 4, b
#define TMR3L5                           BANKMASK(TMR3L), 5, b
#define TMR3L6                           BANKMASK(TMR3L), 6, b
#define TMR3L7                           BANKMASK(TMR3L), 7, b
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, b
#define TMR4                             BANKMASK(SMT1TMRL), 4, b
#define TMR4IE                           BANKMASK(PIE11), 3, a
#define TMR4IF                           BANKMASK(PIR11), 3, a
#define TMR4IP                           BANKMASK(IPR11), 3, b
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 7, b
#define TMR5                             BANKMASK(SMT1TMRL), 5, b
#define TMR5GIE                          BANKMASK(PIE8), 5, a
#define TMR5GIF                          BANKMASK(PIR8), 5, a
#define TMR5GIP                          BANKMASK(IPR8), 5, b
#define TMR5H0                           BANKMASK(TMR5H), 0, b
#define TMR5H1                           BANKMASK(TMR5H), 1, b
#define TMR5H2                           BANKMASK(TMR5H), 2, b
#define TMR5H3                           BANKMASK(TMR5H), 3, b
#define TMR5H4                           BANKMASK(TMR5H), 4, b
#define TMR5H5                           BANKMASK(TMR5H), 5, b
#define TMR5H6                           BANKMASK(TMR5H), 6, b
#define TMR5H7                           BANKMASK(TMR5H), 7, b
#define TMR5IE                           BANKMASK(PIE8), 4, a
#define TMR5IF                           BANKMASK(PIR8), 4, a
#define TMR5IP                           BANKMASK(IPR8), 4, b
#define TMR5L0                           BANKMASK(TMR5L), 0, b
#define TMR5L1                           BANKMASK(TMR5L), 1, b
#define TMR5L2                           BANKMASK(TMR5L), 2, b
#define TMR5L3                           BANKMASK(TMR5L), 3, b
#define TMR5L4                           BANKMASK(TMR5L), 4, b
#define TMR5L5                           BANKMASK(TMR5L), 5, b
#define TMR5L6                           BANKMASK(TMR5L), 6, b
#define TMR5L7                           BANKMASK(TMR5L), 7, b
#define TMR5MD                           BANKMASK(PMD1), 5, b
