GopalSaraf/Practicals/PSDL/include/proc/pic18f47q83.inc
#define TUIN1PPS2                        BANKMASK(TUIN1PPS), 2, b
#define TUIN1PPS3                        BANKMASK(TUIN1PPS), 3, b
#define TUIN1PPS4                        BANKMASK(TUIN1PPS), 4, b
#define TUIN1PPS5                        BANKMASK(TUIN1PPS), 5, b
#define TUN0                             BANKMASK(OSCTUNE), 0, b
#define TUN1                             BANKMASK(OSCTUNE), 1, b
#define TUN2                             BANKMASK(OSCTUNE), 2, b
#define TUN3                             BANKMASK(OSCTUNE), 3, b
#define TUN4                             BANKMASK(OSCTUNE), 4, b
#define TUN5                             BANKMASK(OSCTUNE), 5, b
#define TXBO                             BANKMASK(C1TRECU), 5, b
#define TXBOERR                          BANKMASK(C1BDIAG1U), 7, b
#define TXBP                             BANKMASK(C1TRECU), 4, b
#define TXBWS0                           BANKMASK(C1CONT), 4, b
#define TXBWS1                           BANKMASK(C1CONT), 5, b
#define TXBWS2                           BANKMASK(C1CONT), 6, b
#define TXBWS3                           BANKMASK(C1CONT), 7, b
#define TXIE                             BANKMASK(C1INTU), 0, b
#define TXIF                             BANKMASK(C1INTL), 0, b
#define TXQCI0                           BANKMASK(C1TXQSTAH), 0, b
#define TXQCI1                           BANKMASK(C1TXQSTAH), 1, b
#define TXQCI2                           BANKMASK(C1TXQSTAH), 2, b
#define TXQCI3                           BANKMASK(C1TXQSTAH), 3, b
#define TXQCI4                           BANKMASK(C1TXQSTAH), 4, b
#define TXQEIE                           BANKMASK(C1TXQCONL), 2, b
#define TXQEIF                           BANKMASK(C1TXQSTAL), 2, b
#define TXQEN                            BANKMASK(C1CONU), 4, b
#define TXQNIE                           BANKMASK(C1TXQCONL), 0, b
#define TXQNIF                           BANKMASK(C1TXQSTAL), 0, b
#define TXQUA0                           BANKMASK(C1TXQUAL), 0, b
#define TXQUA1                           BANKMASK(C1TXQUAL), 1, b
#define TXQUA10                          BANKMASK(C1TXQUAH), 2, b
#define TXQUA11                          BANKMASK(C1TXQUAH), 3, b
#define TXQUA12                          BANKMASK(C1TXQUAH), 4, b
#define TXQUA13                          BANKMASK(C1TXQUAH), 5, b
#define TXQUA14                          BANKMASK(C1TXQUAH), 6, b
#define TXQUA15                          BANKMASK(C1TXQUAH), 7, b
#define TXQUA16                          BANKMASK(C1TXQUAU), 0, b
#define TXQUA17                          BANKMASK(C1TXQUAU), 1, b
#define TXQUA18                          BANKMASK(C1TXQUAU), 2, b
#define TXQUA19                          BANKMASK(C1TXQUAU), 3, b
#define TXQUA2                           BANKMASK(C1TXQUAL), 2, b
#define TXQUA20                          BANKMASK(C1TXQUAU), 4, b
#define TXQUA21                          BANKMASK(C1TXQUAU), 5, b
#define TXQUA22                          BANKMASK(C1TXQUAU), 6, b
#define TXQUA23                          BANKMASK(C1TXQUAU), 7, b
#define TXQUA24                          BANKMASK(C1TXQUAT), 0, b
#define TXQUA25                          BANKMASK(C1TXQUAT), 1, b
#define TXQUA26                          BANKMASK(C1TXQUAT), 2, b
#define TXQUA27                          BANKMASK(C1TXQUAT), 3, b
#define TXQUA28                          BANKMASK(C1TXQUAT), 4, b
#define TXQUA29                          BANKMASK(C1TXQUAT), 5, b
#define TXQUA3                           BANKMASK(C1TXQUAL), 3, b
#define TXQUA30                          BANKMASK(C1TXQUAT), 6, b
#define TXQUA31                          BANKMASK(C1TXQUAT), 7, b
#define TXQUA4                           BANKMASK(C1TXQUAL), 4, b
#define TXQUA5                           BANKMASK(C1TXQUAL), 5, b
#define TXQUA6                           BANKMASK(C1TXQUAL), 6, b
#define TXQUA7                           BANKMASK(C1TXQUAL), 7, b
#define TXQUA8                           BANKMASK(C1TXQUAH), 0, b
#define TXQUA9                           BANKMASK(C1TXQUAH), 1, b
#define TXREQ0                           BANKMASK(C1TXREQL), 0, b
#define TXREQ1                           BANKMASK(C1TXREQL), 1, b
#define TXREQ10                          BANKMASK(C1TXREQH), 2, b
#define TXREQ11                          BANKMASK(C1TXREQH), 3, b
#define TXREQ12                          BANKMASK(C1TXREQH), 4, b
#define TXREQ13                          BANKMASK(C1TXREQH), 5, b
#define TXREQ14                          BANKMASK(C1TXREQH), 6, b
#define TXREQ15                          BANKMASK(C1TXREQH), 7, b
#define TXREQ16                          BANKMASK(C1TXREQU), 0, b
#define TXREQ17                          BANKMASK(C1TXREQU), 1, b
#define TXREQ18                          BANKMASK(C1TXREQU), 2, b
#define TXREQ19                          BANKMASK(C1TXREQU), 3, b
#define TXREQ2                           BANKMASK(C1TXREQL), 2, b
#define TXREQ20                          BANKMASK(C1TXREQU), 4, b
#define TXREQ21                          BANKMASK(C1TXREQU), 5, b
#define TXREQ22                          BANKMASK(C1TXREQU), 6, b
#define TXREQ23                          BANKMASK(C1TXREQU), 7, b
#define TXREQ24                          BANKMASK(C1TXREQT), 0, b
#define TXREQ25                          BANKMASK(C1TXREQT), 1, b
#define TXREQ26                          BANKMASK(C1TXREQT), 2, b
#define TXREQ27                          BANKMASK(C1TXREQT), 3, b
#define TXREQ28                          BANKMASK(C1TXREQT), 4, b
#define TXREQ29                          BANKMASK(C1TXREQT), 5, b
#define TXREQ3                           BANKMASK(C1TXREQL), 3, b
#define TXREQ30                          BANKMASK(C1TXREQT), 6, b
#define TXREQ31                          BANKMASK(C1TXREQT), 7, b
#define TXREQ4                           BANKMASK(C1TXREQL), 4, b
#define TXREQ5                           BANKMASK(C1TXREQL), 5, b
#define TXREQ6                           BANKMASK(C1TXREQL), 6, b
#define TXREQ7                           BANKMASK(C1TXREQL), 7, b
#define TXREQ8                           BANKMASK(C1TXREQH), 0, b
#define TXREQ9                           BANKMASK(C1TXREQH), 1, b
#define TXU                              BANKMASK(I2C1CON1), 1, b
#define TXWARN                           BANKMASK(C1TRECU), 2, b
#define U1ABDEN                          BANKMASK(U1CON0), 6, b
#define U1ABDIE                          BANKMASK(U1UIR), 2, b
#define U1ABDIF                          BANKMASK(U1UIR), 6, b
#define U1ABDOVE                         BANKMASK(U1ERRIE), 5, b
#define U1ABDOVF                         BANKMASK(U1ERRIR), 5, b
#define U1BRGS                           BANKMASK(U1CON0), 7, b
#define U1BRKOVR                         BANKMASK(U1CON1), 1, b
#define U1C0EN                           BANKMASK(U1CON2), 3, b
#define U1CERIE                          BANKMASK(U1ERRIE), 4, b
#define U1CERIF                          BANKMASK(U1ERRIR), 4, b
#define U1CTSPPS0                        BANKMASK(U1CTSPPS), 0, b
#define U1CTSPPS1                        BANKMASK(U1CTSPPS), 1, b
#define U1CTSPPS2                        BANKMASK(U1CTSPPS), 2, b
#define U1CTSPPS3                        BANKMASK(U1CTSPPS), 3, b
#define U1CTSPPS4                        BANKMASK(U1CTSPPS), 4, b
#define U1CTSPPS5                        BANKMASK(U1CTSPPS), 5, b
#define U1EIE                            BANKMASK(PIE4), 2, a
#define U1EIF                            BANKMASK(PIR4), 2, a
#define U1EIP                            BANKMASK(IPR4), 2, b
#define U1FERIE                          BANKMASK(U1ERRIE), 3, b
#define U1FERIF                          BANKMASK(U1ERRIR), 3, b
#define U1FLO0                           BANKMASK(U1CON2), 0, b
#define U1FLO1                           BANKMASK(U1CON2), 1, b
#define U1IE                             BANKMASK(PIE4), 3, a
#define U1IF                             BANKMASK(PIR4), 3, a
#define U1IP                             BANKMASK(IPR4), 3, b
#define U1MD                             BANKMASK(PMD6), 3, b
#define U1MODE0                          BANKMASK(U1CON0), 0, b
#define U1MODE1                          BANKMASK(U1CON0), 1, b
#define U1MODE2                          BANKMASK(U1CON0), 2, b
#define U1MODE3                          BANKMASK(U1CON0), 3, b
#define U1ON                             BANKMASK(U1CON1), 7, b
#define U1PERIE                          BANKMASK(U1ERRIE), 6, b
#define U1PERIF                          BANKMASK(U1ERRIR), 6, b
#define U1RCIDL                          BANKMASK(U1FIFO), 3, b
#define U1RUNOVF                         BANKMASK(U1CON2), 7, b
#define U1RXBE                           BANKMASK(U1FIFO), 1, b
#define U1RXBF                           BANKMASK(U1FIFO), 0, b
#define U1RXBIMD                         BANKMASK(U1CON1), 3, b
#define U1RXBKIE                         BANKMASK(U1ERRIE), 2, b
#define U1RXBKIF                         BANKMASK(U1ERRIR), 2, b
#define U1RXEN                           BANKMASK(U1CON0), 4, b
#define U1RXFOIE                         BANKMASK(U1ERRIE), 1, b
#define U1RXFOIF                         BANKMASK(U1ERRIR), 1, b
#define U1RXIDL                          BANKMASK(U1FIFO), 3, b
#define U1RXIE                           BANKMASK(PIE4), 0, a
#define U1RXIF                           BANKMASK(PIR4), 0, a
#define U1RXIP                           BANKMASK(IPR4), 0, b
#define U1RXPOL                          BANKMASK(U1CON2), 6, b
#define U1RXPPS0                         BANKMASK(U1RXPPS), 0, b
#define U1RXPPS1                         BANKMASK(U1RXPPS), 1, b
#define U1RXPPS2                         BANKMASK(U1RXPPS), 2, b
#define U1RXPPS3                         BANKMASK(U1RXPPS), 3, b
#define U1RXPPS4                         BANKMASK(U1RXPPS), 4, b
#define U1RXPPS5                         BANKMASK(U1RXPPS), 5, b
#define U1SENDB                          BANKMASK(U1CON1), 0, b
#define U1STP0                           BANKMASK(U1CON2), 4, b
#define U1STP1                           BANKMASK(U1CON2), 5, b
#define U1STPMD                          BANKMASK(U1FIFO), 6, b
#define U1TXBE                           BANKMASK(U1FIFO), 5, b
#define U1TXBF                           BANKMASK(U1FIFO), 4, b
#define U1TXCIE                          BANKMASK(U1ERRIE), 0, b
#define U1TXCIF                          BANKMASK(U1ERRIR), 0, b
#define U1TXEN                           BANKMASK(U1CON0), 5, b
#define U1TXIE                           BANKMASK(PIE4), 1, a
#define U1TXIF                           BANKMASK(PIR4), 1, a
#define U1TXIP                           BANKMASK(IPR4), 1, b
#define U1TXMTIE                         BANKMASK(U1ERRIE), 7, b
#define U1TXMTIF                         BANKMASK(U1ERRIR), 7, b
#define U1TXPOL                          BANKMASK(U1CON2), 2, b
#define U1TXWRE                          BANKMASK(U1FIFO), 7, b
#define U1WUE                            BANKMASK(U1CON1), 4, b
#define U1WUIF                           BANKMASK(U1UIR), 7, b
#define U1XON                            BANKMASK(U1FIFO), 2, b
#define U2ABDEN                          BANKMASK(U2CON0), 6, b
#define U2ABDIE                          BANKMASK(U2UIR), 2, b
#define U2ABDIF                          BANKMASK(U2UIR), 6, b
#define U2ABDOVE                         BANKMASK(U2ERRIE), 5, b
#define U2ABDOVF                         BANKMASK(U2ERRIR), 5, b
#define U2BRGS                           BANKMASK(U2CON0), 7, b
#define U2BRKOVR                         BANKMASK(U2CON1), 1, b
#define U2C0EN                           BANKMASK(U2CON2), 3, b
#define U2CERIE                          BANKMASK(U2ERRIE), 4, b
#define U2CERIF                          BANKMASK(U2ERRIR), 4, b
#define U2CTSPPS0                        BANKMASK(U2CTSPPS), 0, b
#define U2CTSPPS1                        BANKMASK(U2CTSPPS), 1, b
#define U2CTSPPS2                        BANKMASK(U2CTSPPS), 2, b
#define U2CTSPPS3                        BANKMASK(U2CTSPPS), 3, b
#define U2CTSPPS4                        BANKMASK(U2CTSPPS), 4, b
#define U2EIE                            BANKMASK(PIE8), 2, a
#define U2EIF                            BANKMASK(PIR8), 2, a
#define U2EIP                            BANKMASK(IPR8), 2, b
#define U2FERIE                          BANKMASK(U2ERRIE), 3, b
#define U2FERIF                          BANKMASK(U2ERRIR), 3, b
#define U2FLO0                           BANKMASK(U2CON2), 0, b
#define U2FLO1                           BANKMASK(U2CON2), 1, b
#define U2IE                             BANKMASK(PIE8), 3, a
#define U2IF                             BANKMASK(PIR8), 3, a
#define U2IP                             BANKMASK(IPR8), 3, b
#define U2MD                             BANKMASK(PMD6), 4, b
#define U2MODE0                          BANKMASK(U2CON0), 0, b
#define U2MODE1                          BANKMASK(U2CON0), 1, b
#define U2MODE2                          BANKMASK(U2CON0), 2, b
#define U2MODE3                          BANKMASK(U2CON0), 3, b
#define U2ON                             BANKMASK(U2CON1), 7, b
#define U2PERIE                          BANKMASK(U2ERRIE), 6, b
#define U2PERIF                          BANKMASK(U2ERRIR), 6, b
#define U2RCIDL                          BANKMASK(U2FIFO), 3, b
#define U2RUNOVF                         BANKMASK(U2CON2), 7, b
#define U2RXBE                           BANKMASK(U2FIFO), 1, b
#define U2RXBF                           BANKMASK(U2FIFO), 0, b
#define U2RXBIMD                         BANKMASK(U2CON1), 3, b
#define U2RXBKIE                         BANKMASK(U2ERRIE), 2, b
#define U2RXBKIF                         BANKMASK(U2ERRIR), 2, b
#define U2RXEN                           BANKMASK(U2CON0), 4, b
#define U2RXFOIE                         BANKMASK(U2ERRIE), 1, b
#define U2RXFOIF                         BANKMASK(U2ERRIR), 1, b
#define U2RXIDL                          BANKMASK(U2FIFO), 3, b
#define U2RXIE                           BANKMASK(PIE8), 0, a
#define U2RXIF                           BANKMASK(PIR8), 0, a
#define U2RXIP                           BANKMASK(IPR8), 0, b
#define U2RXPOL                          BANKMASK(U2CON2), 6, b
#define U2RXPPS0                         BANKMASK(U2RXPPS), 0, b
#define U2RXPPS1                         BANKMASK(U2RXPPS), 1, b
#define U2RXPPS2                         BANKMASK(U2RXPPS), 2, b
#define U2RXPPS3                         BANKMASK(U2RXPPS), 3, b
#define U2RXPPS4                         BANKMASK(U2RXPPS), 4, b
#define U2SENDB                          BANKMASK(U2CON1), 0, b
#define U2STP0                           BANKMASK(U2CON2), 4, b
#define U2STP1                           BANKMASK(U2CON2), 5, b
#define U2STPMD                          BANKMASK(U2FIFO), 6, b
#define U2TXBE                           BANKMASK(U2FIFO), 5, b
#define U2TXBF                           BANKMASK(U2FIFO), 4, b
#define U2TXCIE                          BANKMASK(U2ERRIE), 0, b
#define U2TXCIF                          BANKMASK(U2ERRIR), 0, b
#define U2TXEN                           BANKMASK(U2CON0), 5, b
#define U2TXIE                           BANKMASK(PIE8), 1, a
#define U2TXIF                           BANKMASK(PIR8), 1, a
#define U2TXIP                           BANKMASK(IPR8), 1, b
#define U2TXMTIE                         BANKMASK(U2ERRIE), 7, b
#define U2TXMTIF                         BANKMASK(U2ERRIR), 7, b
#define U2TXPOL                          BANKMASK(U2CON2), 2, b
#define U2TXWRE                          BANKMASK(U2FIFO), 7, b
#define U2WUE                            BANKMASK(U2CON1), 4, b
#define U2WUIF                           BANKMASK(U2UIR), 7, b
#define U2XON                            BANKMASK(U2FIFO), 2, b
#define U3ABDEN                          BANKMASK(U3CON0), 6, b
#define U3ABDIE                          BANKMASK(U3UIR), 2, b
#define U3ABDIF                          BANKMASK(U3UIR), 6, b
#define U3ABDOVE                         BANKMASK(U3ERRIE), 5, b
#define U3ABDOVF                         BANKMASK(U3ERRIR), 5, b
#define U3BRGS                           BANKMASK(U3CON0), 7, b
#define U3BRKOVR                         BANKMASK(U3CON1), 1, b
#define U3CERIE                          BANKMASK(U3ERRIE), 4, b
#define U3CERIF                          BANKMASK(U3ERRIR), 4, b
#define U3CTSPPS0                        BANKMASK(U3CTSPPS), 0, b
#define U3CTSPPS1                        BANKMASK(U3CTSPPS), 1, b
#define U3CTSPPS2                        BANKMASK(U3CTSPPS), 2, b
#define U3CTSPPS3                        BANKMASK(U3CTSPPS), 3, b
#define U3CTSPPS4                        BANKMASK(U3CTSPPS), 4, b
#define U3CTSPPS5                        BANKMASK(U3CTSPPS), 5, b
#define U3EIE                            BANKMASK(PIE9), 2, a
#define U3EIF                            BANKMASK(PIR9), 2, a
#define U3EIP                            BANKMASK(IPR9), 2, b
#define U3FERIE                          BANKMASK(U3ERRIE), 3, b
#define U3FERIF                          BANKMASK(U3ERRIR), 3, b
#define U3FLO0                           BANKMASK(U3CON2), 0, b
#define U3FLO1                           BANKMASK(U3CON2), 1, b
#define U3IE                             BANKMASK(PIE9), 3, a
#define U3IF                             BANKMASK(PIR9), 3, a
#define U3IP                             BANKMASK(IPR9), 3, b
#define U3MD                             BANKMASK(PMD6), 5, b
#define U3MODE0                          BANKMASK(U3CON0), 0, b
#define U3MODE1                          BANKMASK(U3CON0), 1, b
#define U3MODE2                          BANKMASK(U3CON0), 2, b
#define U3ON                             BANKMASK(U3CON1), 7, b
#define U3PERIE                          BANKMASK(U3ERRIE), 6, b
#define U3PERIF                          BANKMASK(U3ERRIR), 6, b
#define U3RCIDL                          BANKMASK(U3FIFO), 3, b
#define U3RUNOVF                         BANKMASK(U3CON2), 7, b
#define U3RXBE                           BANKMASK(U3FIFO), 1, b
#define U3RXBF                           BANKMASK(U3FIFO), 0, b
#define U3RXBIMD                         BANKMASK(U3CON1), 3, b
#define U3RXBKIE                         BANKMASK(U3ERRIE), 2, b
#define U3RXBKIF                         BANKMASK(U3ERRIR), 2, b
#define U3RXEN                           BANKMASK(U3CON0), 4, b
#define U3RXFOIE                         BANKMASK(U3ERRIE), 1, b
#define U3RXFOIF                         BANKMASK(U3ERRIR), 1, b
#define U3RXIDL                          BANKMASK(U3FIFO), 3, b
#define U3RXIE                           BANKMASK(PIE9), 0, a
#define U3RXIF                           BANKMASK(PIR9), 0, a
#define U3RXIP                           BANKMASK(IPR9), 0, b
#define U3RXPOL                          BANKMASK(U3CON2), 6, b
#define U3RXPPS0                         BANKMASK(U3RXPPS), 0, b
#define U3RXPPS1                         BANKMASK(U3RXPPS), 1, b
#define U3RXPPS2                         BANKMASK(U3RXPPS), 2, b
#define U3RXPPS3                         BANKMASK(U3RXPPS), 3, b
#define U3RXPPS4                         BANKMASK(U3RXPPS), 4, b
#define U3RXPPS5                         BANKMASK(U3RXPPS), 5, b
#define U3SENDB                          BANKMASK(U3CON1), 0, b
#define U3STP0                           BANKMASK(U3CON2), 4, b
#define U3STP1                           BANKMASK(U3CON2), 5, b
#define U3STPMD                          BANKMASK(U3FIFO), 6, b
#define U3TXBE                           BANKMASK(U3FIFO), 5, b
#define U3TXBF                           BANKMASK(U3FIFO), 4, b
#define U3TXCIE                          BANKMASK(U3ERRIE), 0, b
#define U3TXCIF                          BANKMASK(U3ERRIR), 0, b
#define U3TXEN                           BANKMASK(U3CON0), 5, b
#define U3TXIE                           BANKMASK(PIE9), 1, a
#define U3TXIF                           BANKMASK(PIR9), 1, a
#define U3TXIP                           BANKMASK(IPR9), 1, b
#define U3TXMTIE                         BANKMASK(U3ERRIE), 7, b
#define U3TXMTIF                         BANKMASK(U3ERRIR), 7, b
#define U3TXPOL                          BANKMASK(U3CON2), 2, b
#define U3TXWRE                          BANKMASK(U3FIFO), 7, b
#define U3WUE                            BANKMASK(U3CON1), 4, b
#define U3WUIF                           BANKMASK(U3UIR), 7, b
#define U3XON                            BANKMASK(U3FIFO), 2, b
#define U4ABDEN                          BANKMASK(U4CON0), 6, b
#define U4ABDIE                          BANKMASK(U4UIR), 2, b
#define U4ABDIF                          BANKMASK(U4UIR), 6, b
#define U4ABDOVE                         BANKMASK(U4ERRIE), 5, b
#define U4ABDOVF                         BANKMASK(U4ERRIR), 5, b
#define U4BRGS                           BANKMASK(U4CON0), 7, b
#define U4BRKOVR                         BANKMASK(U4CON1), 1, b
#define U4CERIE                          BANKMASK(U4ERRIE), 4, b
#define U4CERIF                          BANKMASK(U4ERRIR), 4, b
#define U4CTSPPS0                        BANKMASK(U4CTSPPS), 0, b
#define U4CTSPPS1                        BANKMASK(U4CTSPPS), 1, b
#define U4CTSPPS2                        BANKMASK(U4CTSPPS), 2, b
#define U4CTSPPS3                        BANKMASK(U4CTSPPS), 3, b
#define U4CTSPPS4                        BANKMASK(U4CTSPPS), 4, b
#define U4EIE                            BANKMASK(PIE12), 2, a
#define U4EIF                            BANKMASK(PIR12), 2, a
#define U4EIP                            BANKMASK(IPR12), 2, b
#define U4FERIE                          BANKMASK(U4ERRIE), 3, b
#define U4FERIF                          BANKMASK(U4ERRIR), 3, b
#define U4FLO0                           BANKMASK(U4CON2), 0, b
#define U4FLO1                           BANKMASK(U4CON2), 1, b
#define U4IE                             BANKMASK(PIE12), 3, a
#define U4IF                             BANKMASK(PIR12), 3, a
#define U4IP                             BANKMASK(IPR12), 3, b
#define U4MD                             BANKMASK(PMD6), 6, b
#define U4MODE0                          BANKMASK(U4CON0), 0, b
#define U4MODE1                          BANKMASK(U4CON0), 1, b
#define U4MODE2                          BANKMASK(U4CON0), 2, b
#define U4ON                             BANKMASK(U4CON1), 7, b
#define U4PERIE                          BANKMASK(U4ERRIE), 6, b
#define U4PERIF                          BANKMASK(U4ERRIR), 6, b
#define U4RCIDL                          BANKMASK(U4FIFO), 3, b
#define U4RUNOVF                         BANKMASK(U4CON2), 7, b
#define U4RXBE                           BANKMASK(U4FIFO), 1, b
#define U4RXBF                           BANKMASK(U4FIFO), 0, b
#define U4RXBIMD                         BANKMASK(U4CON1), 3, b
#define U4RXBKIE                         BANKMASK(U4ERRIE), 2, b
#define U4RXBKIF                         BANKMASK(U4ERRIR), 2, b
#define U4RXEN                           BANKMASK(U4CON0), 4, b
#define U4RXFOIE                         BANKMASK(U4ERRIE), 1, b
#define U4RXFOIF                         BANKMASK(U4ERRIR), 1, b
#define U4RXIDL                          BANKMASK(U4FIFO), 3, b
#define U4RXIE                           BANKMASK(PIE12), 0, a
#define U4RXIF                           BANKMASK(PIR12), 0, a
#define U4RXIP                           BANKMASK(IPR12), 0, b
#define U4RXPOL                          BANKMASK(U4CON2), 6, b
#define U4RXPPS0                         BANKMASK(U4RXPPS), 0, b
#define U4RXPPS1                         BANKMASK(U4RXPPS), 1, b
#define U4RXPPS2                         BANKMASK(U4RXPPS), 2, b
#define U4RXPPS3                         BANKMASK(U4RXPPS), 3, b
#define U4RXPPS4                         BANKMASK(U4RXPPS), 4, b
#define U4SENDB                          BANKMASK(U4CON1), 0, b
#define U4STP0                           BANKMASK(U4CON2), 4, b
#define U4STP1                           BANKMASK(U4CON2), 5, b
#define U4STPMD                          BANKMASK(U4FIFO), 6, b
#define U4TXBE                           BANKMASK(U4FIFO), 5, b
#define U4TXBF                           BANKMASK(U4FIFO), 4, b
#define U4TXCIE                          BANKMASK(U4ERRIE), 0, b
